{
  "1_mark": [
    {
      "question": "discuss the impact of the `ze` value on performance (i.e., how the size of the hash table affects runtime.)",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Computer Networks",
      "subtopic": "Collision Resolution",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Here’s the Which of the following relationships best describes the parent-child hierarchy presented in the text? (a) A is the direct child of B, and B is the direct child of A. (b) A is a direct child of B, and B is a direct child of A. (c) A is a distant relative of B, and B is a distant relative of A. (d) A is a descendant of B, and B is a descendant of A. Justify your answer, referencing specific details from the text.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Algorithms",
      "subtopic": "Parent-Child Relationships",
      "time": 2,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A small bakery specializes in sourdough bread. They use a precise method of proofing dough. They want to optimize their process to reduce fermentation time while maintaining consistent crumb structure. What is the most efficient way to accelerate the proofing process without significantly altering the final product's characteristics? (a) Increase the temperature of the room where the dough is placed. (b) Utilize a faster kneading technique. (c) Implement a batch-wise proofing method with shorter intervals between each proof.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Algorithms",
      "subtopic": "Proofing Process Optimization",
      "time": 2,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A small bakery is preparing a large batch of blueberry muffins for a local festival. They need to bake 128 muffins. They have 48 blueberries and 24 chocolate chips. They want to maximize the use of blueberries while minimizing the amount of chocolate chips used. How many chocolate chips should they use in total to achieve this?",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Algorithms",
      "subtopic": "Optimization & Resource Allocation",
      "time": 4,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Here’s the How does the data access mechanism differ between a stack and a queue in the context of checker implementation, and which approach is more efficient for processing data based on the provided scenario? Explain the differences with a specific example.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Stacks",
      "subtopic": "Data Access Mechanisms",
      "time": 4,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Here’s the How does the data access mechanism differ between a stack and a queue in the context of checker implementation, and which approach is more efficient for processing data based on the provided scenario? Explain the differences with a specific example.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Stacks",
      "subtopic": "Data Access Mechanisms",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A small bakery specializes in custom cake designs. They need to create a cake for a birthday party – a large, round cake for approximately 50 guests. They want the cake to have a unique, swirling pattern of chocolate and vanilla frosting, and the overall design should resemble a stylized, oversized flower. Considering these constraints, which of the following is the MOST appropriate method for creating this complex design with minimal waste of frosting? (a) Using a pre-made cake stencil with a simple floral pattern and then applying frosting to it. (b) Creating the design layer by layer, starting with a base of chocolate frosting and gradually adding vanilla, ensuring the swirl effect is achieved with each layer. (c) Employing a digital design tool to create a complex pattern, then manually transferring it to the cake, resulting in a slightly less visually dynamic outcome. (d) Employing a single color frosting that can be layered and blended to create the swirling effect.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Algorithms",
      "subtopic": "Cake Design & Frosting",
      "time": 4,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you are designing a system to efficiently validate email addresses in a database. The database contains a list of email addresses, and you need to check if each address is valid according to a set of rules. Describe, in detail, how you would approach this validation process using a stack data structure to efficiently manage the validation steps. Explain the logic behind using the stack for each stage of validation, and consider edge cases like invalid characters or missing parts of the email address.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Stacks",
      "subtopic": "Stack Validation",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A small business is analyzing the cost of producing different types of widgets. They have two production processes: Process A and Process B. Process A uses 20 hours of labor per widget, while Process B uses 30 hours of labor per widget. The business wants to minimize the total production time. Which process is more efficient for producing widgets with a total production time of 100 hours? Justify your answer based on the time required per widget.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Algorithms",
      "subtopic": "Production Time Analysis",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you are developing a palindrome checker using both a stack and a queue. Explain how the stack and queue mechanisms differ in their approaches to handling palindromic string processing, specifically focusing on the steps involved in identifying and extracting the palindrome. Provide a concise example demonstrating how the stack and queue would be used to accomplish this task.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Stacks",
      "subtopic": "Stacks And Queues",
      "time": 7,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a 2D sorted matrix representing a maze. The matrix contains the coordinates of each cell. You need to determine if a specific key ('key') exists within this maze. Describe a time-efficient search strategy you could employ, including the steps involved and the expected time/space complexity. Explain why this strategy is suitable for this specific scenario.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Mathematics",
      "subtopic": "Search Strategies",
      "time": 7,
      "source_file": "Initial_Questions"
    },
    {
      "question": "the 2-D sorted matrix below (each row and each column is sorted in ascending order) and describe a efficient searching strategy to determine whether a given key exists in the matrix for key-22 and show sequence of comparisons.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Mathematics",
      "subtopic": "Searching Strategy",
      "time": 8,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you are building a digital library system. You have a collection of books with titles, authors, and publication dates. The system needs to efficiently add new books and delete old ones. Describe, in detail, how you would implement a basic AVL tree to store these books, and explain the time complexities involved in insertion and deletion operations.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Sorting",
      "subtopic": "Avl Tree Implementation",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you are designing a system to efficiently sort a large collection of customer orders. The order data consists of customer names, order dates, and order values. You randomly select a subset of these orders to test the performance of a new sorting algorithm. You want to assess the algorithm’s speed with a specific subset of orders. What is the MOST effective strategy to ensure a representative sample of orders is selected, maximizing the chances of obtaining statistically significant results for the sorting algorithm’s performance? Justify your answer with a clear explanation of why your chosen approach is superior to simpler alternatives.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Sorting",
      "subtopic": "Sorting Performance",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are tasked with implementing an AVL tree to store a collection of books. The AVL tree is designed to maintain a balance, ensuring optimal performance for search and insertion operations. The AVL tree will be used to store books with their titles, authors, and publication dates. Specifically, you need to draw the resulting BST after 5 books are removed and before any rebalancing occurs. Label each node in the resulting tree with its balance factor. Assume the initial tree is a simple BST. After removing 5 books, the resulting tree is unbalanced. Draw a new tree for each rotation that occurs when rebalancing the AVL tree (you only need to draw one tree that results from an RL or LR Rotation). Briefly explain the rationale behind the design choices you make, highlighting the importance of the balance factor in maintaining the AVL tree's functionality.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Trees",
      "subtopic": "Trees",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A small, automated system needs to analyze customer reviews to identify sentiment. The system currently outputs a sentiment score (positive, negative, or neutral) for each review. You are given a dataset of 1000 customer reviews. Analyze the data to determine which review types – short, long, and negative – are most likely to have a significantly higher sentiment score. Provide three distinct examples of what you would do to analyze this data to inform this decision.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Algorithms",
      "subtopic": "Sentiment Analysis",
      "time": 7,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A student is designing a system to store and retrieve information about books in a library. They need to implement a system that allows users to search for books by title and author. Describe how you would use a Binary Search Tree (BST) to implement this search functionality, highlighting the benefits and potential drawbacks of this choice. Explain why a BST is a suitable choice for this specific task.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Trees",
      "subtopic": "Trees: Search Implementation",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The provided text describes a method for determining if a given string contains all possible pre-fixes of the digits 1, 34, 22, 6, 89, 0, 12, 124, 122. Specifically, it states that the best suitable dat state can be used to identify whether the given string contains all possible pre-fixes of the digits. How would you accomplish this, and what is the fundamental principle behind the method?",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Searching",
      "subtopic": "Data State Analysis",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "here’s the  Describe the purpose of the ‘insert’ operation in the binomial heap and explain how it maintains the heap property. Provide a simple example of how inserting a single element would affect the heap structure.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Sorting",
      "subtopic": "Heap Structure And Purpose",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A customer’s order contains multiple identical items (e.g., '09', '12', '18'). Describe a method to identify and eliminate duplicate elements within a list of items in a simplified order system, focusing on the practical steps required to achieve this. Explain the impact of this process on the system's overall performance.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Sorting",
      "subtopic": "Identifying Duplicates",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you are designing a system to efficiently identify duplicate entries in a large dataset of customer orders. The dataset contains customer IDs and order details (product, quantity, price, date, etc.). The goal is to quickly determine if any order records appear more than once. What is a “spurious hit” in the context of this scenario, and how would you mitigate its impact on the accuracy of your duplicate detection process? Explain your approach, detailing the potential pitfalls and trade-offs involved.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Graphs",
      "subtopic": "Duplicate Detection",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A small business owner wants to track their daily sales. They currently use a spreadsheet that is manually updated. They want to automate this process to improve efficiency. Which of the following is the MOST effective approach to automate this process? (a) Manually input each sale into the spreadsheet. (b) Create a new spreadsheet with a formula that automatically calculates total sales daily. (c) Develop a small program using a scripting language to update the spreadsheet based on sales data. ---",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Algorithms",
      "subtopic": "Algorithm Development",
      "time": 7,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a telecom company distributing SIM cards across a state. They’ve constructed a weighted graph G(V,E,w) where V represents cities, E represents connections between cities, and w represents the cost of travel between cities. The company wants to determine the shortest path distance between every pair of cities. Specifically, for each pair of cities (u, v), find the minimum total cost of travel (w(u,v)) needed to travel from city u to city v. Provide an algorithm to compute this minimum cost. Explain the steps involved.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Graphs",
      "subtopic": "Algorithms And Optimization",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A small bakery is experimenting with a new recipe for cupcakes. They want to reduce the baking time by 10 minutes. They currently use a recipe that takes 30 minutes to bake. What is the most efficient method to reduce the baking time while maintaining a consistent cupcake texture and appearance? (a) Increase the oven temperature by 5 degrees Celsius. (b) Reduce the amount of flour used in the recipe by 20% and increase the sugar by 5%. (c) Preheat the oven to the highest temperature and bake for 25 minutes instead of 30 minutes.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Algorithms",
      "subtopic": "Recipe Optimization",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you are tasked with designing a system to efficiently sort a large list of customer names based on their last name. The list is expected to contain thousands of names. Which data structure would you choose and why? Briefly explain the benefits of your choice compared to other potential options like a simple array or a hash table, considering factors like time and space complexity.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine a viv3 (a binary tree) is constructed with the following structure: root node, left child with a value of 5, and right child with a value of 10. What is the worst-case time complexity of the `convert_BST_MaxHeap` function when it traverses the viv3 to find the maximum value? Provide a brief explanation of why this is the worst-case scenario.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Graphs",
      "subtopic": "Tree Traversal",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a scenario where you need to determine the average of a set of numbers, and you are given a specific range of numbers (`x` to `y`). How would you implement the `F2(int cal, int x, int n)` function to calculate the average, given that the function’s sole purpose is to return the calculated average? Explain the fundamental logic behind this implementation.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Arrays",
      "subtopic": "Calculation And Average",
      "time": 7,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The provided sequence represents the assignment of function values modulo 7 for the function `(3x + 5) mod 7` for the first 17 values. Determine the most likely rule governing this assignment. (a) What is the standard approach to assigning values to the modulo 7 operation, considering the potential for conflicts? (b) Explain how the current assignment prioritizes slots, and why this approach may be considered optimal or suboptimal given the constraints of the input data? (c) Considering the limited number of slots available, suggest a possible strategy to implement this assignment, explaining why your suggested strategy would be appropriate.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Hash Tables",
      "subtopic": "Hash Functions",
      "time": 3,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider only the integer part of the mid i.e., mid =2 = key A[2] =34 35 so reset high = mid 1 = 1 low = 0 high = 1 Since (low high) mid = 0+(1-0) x ((34 2)/(25-2)) =3 x (32/23) =1 =key A[1]",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Algorithms",
      "subtopic": "Algorithm Analysis",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A small bakery is experimenting with a new flavor of cake – ‘Midnight Bloom’. They want to create a cake that evokes a sense of mystery and indulgence. They want to use dark chocolate and lavender to achieve this. Which of the following is the MOST effective strategy to ensure a consistent and appealing ‘Midnight Bloom’ cake flavor profile, considering both taste and visual presentation? (a) Using a single type of dark chocolate with a precise percentage of cocoa solids to maximize bitterness. (b) Employing a blend of dark chocolate, lavender extract, and a touch of vanilla to create a layered flavor experience. (c) Prioritizing the visual aesthetic of the cake by using a dark chocolate glaze with a subtle lavender swirl, focusing solely on color and texture. (d) Conducting a sensory testing campaign to gather feedback on each element of the flavor, then adjusting the recipe based on those results.  Short (2 marks) Describe, step-by-step, how you would implement a simple algorithm to determine the maximum number of distinct customer orders a bookstore can fulfill within a given time period, considering the number of available books and the average order processing time per book. Provide pseudocode.  Descriptive (3+ marks) Design an algorithm that efficiently finds all the prime numbers within a given range (1 to 20) and presents the results in a visually appealing and easily sortable format. Include a clear explanation of your approach and a justification for the chosen data structure. Consider time and space complexity.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Algorithms",
      "subtopic": "General",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A small business owner wants to implement a new marketing strategy to increase sales. They have a limited budget and want to reach a broad audience. They’ve chosen to focus on social media marketing. Which of the following is the MOST crucial factor to consider when selecting the specific platforms for their marketing campaign? (a) Prioritizing platforms with the highest user base. (b) Considering the target audience's preferred social media channels. (c) Analyzing the cost per impression and return on investment for each platform. (d) Selecting platforms based solely on visual appeal of the brand. Explanation: The question requires understanding of the strategic considerations driving platform selection, not just a superficial preference. --- Short (2 marks) Implement a sorting algorithm (e.g., merge sort or quicksort) to sort a list of numbers. Provide a pseudocode implementation demonstrating the core logic, clearly labeling the sorting process and stating the time and space complexity of the algorithm in terms of the input size. Explanation: This requires a practical implementation and evaluation of a basic algorithm. --- Descriptive (3+ marks) Describe how a database can be designed to efficiently store and retrieve information about customer orders, including the key tables, relationships between tables, and the types of queries that would be most effective for retrieving a customer's order history. Discuss at least two performance optimization techniques you might employ to improve the query speed, detailing the potential benefits and drawbacks of each. Include a simple SQL query that demonstrates the retrieval of the last five orders for a specific customer.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Algorithms",
      "subtopic": "Platform Selection Strategy",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A small bakery is experimenting with a new pastry – the ‘Honeycomb Delight.’ They want to produce 100 Honeycomb Delights each day. They have 20 hours available for production. What is the maximum number of Honeycomb Delights they can produce, considering both time and the number of ingredients required? (a) Produce 50 Honeycomb Delights to maximize output, dedicating the remaining time to other tasks. (b) Produce 100 Honeycomb Delights, using the entire available time for optimal production. (c) Produce 75 Honeycomb Delights, utilizing the 20 hours efficiently, with the remaining hours allocated to preparing the ingredients. --- Short (2 marks): Implement a binary search algorithm to find the largest number in a sorted array of numbers. Explain your approach, highlighting the key steps involved in dividing the array into smaller sub-arrays for comparison. --- Descriptive (3+ marks): Describe the core principles of a design pattern (e.g., Factory, Singleton) for creating a reusable data access layer within a web application. Explain why using this pattern would improve maintainability and scalability. Provide a brief example of how this pattern would be implemented.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Algorithms",
      "subtopic": "Algorithms",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A function `calculate_factorial(n)` calculates the factorial of a non-negative integer `n`. Given `n = 5`, calculate `calculate_factorial(5)` and write the result in scientific notation. Show your step-by-step calculation. Q2: Consider two arrays, `A` and `B`, where `A = [10, 20, 30, 40, 50]` and `B = [5, 4, 3, 2, 1]`. Perform a step-by-step sorting of `A` and `B` in ascending order using the bubble sort algorithm. Identify the number of swaps performed during the sorting process. Q3: Write a program to create a doubly linked list that stores the days of the month in sorted order. The linked list should contain a `Node` class with a `day` attribute representing the day of the month (1-31) and a `next` pointer. Implement a function `add_day(day)` to add a new day to the list, ensuring the days are sorted in ascending order. Q4: Design an algorithm to find the k-th smallest element in an array of numbers. The algorithm should be efficient (e.g., O(n log k) time complexity). Explain the rationale behind the chosen approach. Q5: Critically evaluate the use of recursion versus iteration for calculating the Fibonacci sequence. Justify which approach is more suitable for this specific task, considering potential performance implications and readability. Provide a simple example demonstrating the difference. Q6: Given the following data: [1, 3, 2, 4, 5], implement a function `find_max_value(data)` that returns the maximum value in the given array.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Linked Lists",
      "subtopic": "Algorithm Design",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are working on a system for managing a library’s collection of books. You need to quickly determine which books are most frequently borrowed. Without any pre-existing data structure like arrays or linked lists, how would you efficiently implement this task? Explain your approach and highlight the potential challenges involved.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Trees",
      "subtopic": "Efficient Data Structure Implementation",
      "time": 7,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A small bakery produces cakes daily. They have a limited supply of frosting and sprinkles. They want to create a special cake with a complex frosting design and a unique sprinkle arrangement. They need to determine the optimal number of sprinkles to use to achieve a visually appealing and consistent design. What is the most efficient way to determine this number, considering both the frosting and sprinkle requirements? (a) Simply choose a number that covers the entire design area. (b) Calculate the total area covered by the design and sprinkle arrangement, then select the number that maximizes the coverage. (c) Consider the cost per sprinkle and calculate the total cost for each possible number of sprinkles. Implement/Apply: The bakery has 100 grams of frosting and 50 grams of sprinkles. The design requires a square area of 200 grams. The sprinkle arrangement must cover a similar area. Consider the cost of sprinkles – $0.20 per gram.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Algorithms",
      "subtopic": "General",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you are designing a city layout for a new metropolis. You have 8 cities (1 through 8). You can connect city 1 to city 2, city 2 to city 3, and so on, but you cannot connect city 1 to city 3. Outline a dynamic programming approach to find the maximum number of cities that can be connected, given these constraints. Then, apply this algorithm to the example: 1 -> 2 -> 3, 4 -> 5 -> 6, 7 -> 8. Print the connected city numbers. Answer: a) Dynamic Programming Approach: 1. Define the Problem: We need to find the largest subset of cities that can be formed such that each city is connected to at least one other city. 2. State Definition: Let `dp[i]` represent the maximum number of cities that can be connected from city `i`. 3. Base Case: `dp[1] = 1` (City 1 is connected to itself). 4. Recursive Relation: For each city `i` (from 2 to 8), we consider the possible cities that could be connected to it. If city `i` is connected to any city `j`, then we can increase the maximum connected cities by 1. So, `dp[i] = max(dp[i], dp[j] + 1)` where `j` is a city connected to `i`. 5. Iteration: We iterate from `i = 2` to `8`. For each `i`, we compute `dp[i]` using the recursive relation. 6. Final Result: The maximum value of `dp[i]` across all cities will be the maximum number of connected cities. b) Application to the Example: Let's trace the dynamic programming solution:  `dp[1] = 1`  `dp[2] = max(dp[1], dp[1] + 1) = max(1, 1 + 1) = 2`  `dp[3] = max(dp[2], dp[2] + 1) = max(2, 2 + 1) = 3`  `dp[4] = max(dp[3], dp[3] + 1) = max(3, 3 + 1) = 4`  `dp[5] = max(dp[4], dp[4] + 1) = max(4, 4 + 1) = 5`  `dp[6] = max(dp[5], dp[5] + 1) = max(5, 5 + 1) = 6`  `dp[7] = max(dp[6], dp[6] + 1) = max(6, 6 + 1) = 7`  `dp[8] = max(dp[7], dp[7] + 1) = max(7, 7 + 1) = 8` Therefore, the maximum number of cities that can be connected is 8. c) Space and Time Complexity Analysis:  Space Complexity: O(n), where n is the number of cities (8 in this case). We need to store the `dp` array of size 8 to store the maximum connected cities.  Time Complexity: O(n), where n is the number of cities. The algorithm iterates through the cities from 2 to 8. Each iteration involves a constant amount of computation (max() function). Therefore, the time complexity is linear with respect to the number of cities.",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "How many potential differences or variations in the sequence 'aoeeennnene nena nnnnnnnnnnbnnnnnnnnnnnnnnnennewennnne nee End of paper---------------------------------------0-e-ese-eeeeeneeenne' can be identified when using the KMP algorithm compared to a brute-force approach for pattern matching?",
      "marks": 1,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Algorithms",
      "subtopic": "Algorithms - Pattern Matching",
      "time": 15,
      "source_file": "Initial_Questions"
    }
  ],
  "5_mark": [
    {
      "question": "A B-Tree is used to store data, and the key requirement is that the number of rotations during insertion and deletion operations should be minimized. What is the minimum number of rotations required for a B-Tree with a guaranteed logarithmic worst-case cost for insertion and deletion, and what is the guaranteed degree (number of keys) of the tree? (a) Briefly explain the concept of a B-Tree and how its structure contributes to minimizing rotations. [Marks 1] (b) Describe a scenario where a B-Tree would be a suitable data structure, justifying why it would benefit from the logarithmic worst-case cost. [Marks 1] (c) Derive the expression for the maximum number of keys a B-Tree can hold in terms of order/degree and height of the tree. [Marks 4]",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "understanding",
      "topic": "Trees",
      "subtopic": "Trees",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a B-Tree data structure designed to efficiently store and retrieve data with a logarithmic worst-case cost for insertions, deletions, and searches. Given a tree of order 5 and degree 3, insert the following elements: 5, 3, 21, 9, 1, 13, 2, 7, 10, 12, 4, 8. Calculate the maximum number of keys a B-Tree can hold in terms of order/degree and height of the tree. Starting with an empty B-Tree of order 5/Degree 3, derive the expression to compute the maximum number of keys a B-Tree can hold.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Trees",
      "subtopic": "Trees, Order & Degree",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a B-Tree data structure designed to efficiently store and retrieve keys with a maximum degree of 3. Describe the logical structure of the B-Tree, detailing the role of each node and how the logarithmic worst-case cost is achieved. Assume the initial state is an empty B-Tree of order 5/Degree 3. Insert the following elements into the B-Tree: 5, 3, 21, 9, 1, 13, 2, 7, 10, 12, 4, 8. Calculate the maximum number of keys a B-Tree can hold in terms of order/degree and height of the tree, considering an initially empty B-Tree of order 5/Degree 3. Explain how the insertion process impacts the resulting structure, focusing on the role of the root node and its children in maintaining logarithmic worst-case costs.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Trees",
      "subtopic": "Trees And Insertion",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a hierarchical data structure representing a library system where books are organized into sections, and each section contains multiple books. The system utilizes a tree-like structure where a book is a node, and a parent node indicates the book’s supervisor or a section's leader. Specifically, the Fig. 1 depicts a tree where node 1 represents the Library Head, node 2 represents the Fiction Section, node 3 represents the Non-Fiction Section, node 4 represents the Science Section, node 5 represents the History Section, node 6 represents the Teen Section, and so on. Illustrate how the algorithm can efficiently determine the number of books within a given section by traversing the tree structure to identify and count all books, utilizing a method that avoids nested loops. Provide an example of a single node and a few direct and indirect parent-child relationships for illustration within the tree. Assume a maximum depth of 5 levels in the tree. The algorithm should be designed to handle nodes with potentially multiple direct and indirect parents to accurately count books within a section. What is the most efficient approach to accomplish this count, detailing the steps and the expected time/space complexity? Justify your chosen approach.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Computer Networks",
      "subtopic": "Tree Traversal",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are tasked with optimizing a system for analyzing large datasets of sensor readings from a network of vehicles. These readings contain a significant number of unique identifiers (vehicle IDs), and you need to efficiently identify the most frequent vehicle IDs within a specified subset of the data. The target set of vehicle IDs is a list of 25 elements, with M = 34N = 3425 vehicles in total. You are given a raw dataset of N elements, where each element represents a single vehicle reading. Describe an algorithm to find the intersecting node structure (specifically, the most frequent vehicle ID) in data structures, employing efficient techniques to minimize time and space complexity. Detail the chosen data structure and the reasoning behind its selection, justifying why it’s more suitable than alternative approaches, focusing on O(N) time complexity and O(K) space complexity where K is the number of intersecting nodes. Assume the input array size is N = 10000. Provide an outline of the steps involved in implementing this algorithm using a Python-like pseudocode representation.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Sorting",
      "subtopic": "Data Structures And Algorithms",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Here's the question text:  In a hierarchical structure represented by a 2D array (2DA), each element represents a node and its parent. You are given a 2DA representing the hierarchical structure of a system, where `0` in the `parent` field signifies that a node does not have a parent. Your task is to identify the node (label of the node) with the maximum number of direct and indirect parent-child relationships. Consider a 2DA where the `parent` field contains a sequence of numbers from 1 to `n`, where `n` represents the total number of nodes in the hierarchy. The goal is to find a node whose `parent` values are arranged in a way that maximizes the total count of `parent` values (direct and indirect) compared to all other nodes. Provide a concise explanation of your approach – specifically, how you'd traverse the 2DA to determine this maximum. Assume the 2DA can contain at most `n` nodes.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Computer Networks",
      "subtopic": "Hierarchical Analysis",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A research team is studying the impact of different fertilizer types on crop yield in a specific agricultural region. They’ve collected data showing a strong correlation between nitrogen and phosphorus levels in the soil and the subsequent crop yield. The team wants to determine which fertilizer type, based on the provided data, yields the highest average yield across all tested crops. Describe a method the team could use to evaluate this correlation, including the data analysis techniques they would employ. Provide a justification for your chosen method, highlighting its strengths and weaknesses in the context of the presented data.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Algorithms",
      "subtopic": "Correlation Analysis",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are tasked with analyzing a hierarchical representation of a knowledge graph. Fig. 1 shows a 2D array (2DA) representing a simplified hierarchical structure of knowledge – a tree. The 'parent' field in the 2DA indicates a node's parent; a 'child' node indicates a child node. The goal is to determine the node (label of the node) with the maximum number of direct and indirect parent-child relationships. Specifically, identify the node (X) that represents the root node of the highest degree in the graph. Consider that the graph is represented in a 2DA format. Assume the graph is relatively simple, with a few nodes and few connections (parent-child relationships). Your answer should be a single node label (X) representing the node with the highest degree (most direct and indirect parent connections). Part (a): Provide a conceptual outline of the algorithm you would use to solve this problem. Explain how you would represent the 2DA data for efficient processing. Justify your chosen approach. Part (b): Implement a function that takes a 2DA array as input and returns the node (X) that represents the node with the maximum number of direct and indirect parent-child relationships. Your implementation should be efficient – consider the potential time and space complexity of your solution. Part (c): Assuming a 2DA array of size N (where N is a fixed constant) representing the hierarchical structure, analyze the time and space complexity of your implementation (your function). Derive the mathematical expression representing the complexity.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Computer Networks",
      "subtopic": "Computer Networks",
      "time": 20,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you are designing a system to efficiently track inventory levels in a warehouse. Each time a product is moved between storage locations, you need to update the inventory count for each location. The warehouse has 100 product locations. The `helper(int i, int j, = k)` function is called for each movement of a product. Assume the `k` parameter represents a constant value (e.g., 1 for each movement). Calculate the total number of times the `helper(i, j, k)` function is executed in the worst-case scenario where the warehouse contains a single product, and you make 100 movements. Answer: The number of times the `helper(i, j, k)` function is executed is 100. Explanation: The `helper` function is called 100 times. Each call involves a loop (for(int itenteaat for(int j=1;j=i;j4){ ... }) ), and the `helper` function has a cost proportional to the number of iterations of the loop. Therefore, the total number of times the function is executed is simply 100. Part (a): Consider the warehouse containing a single product. The `helper` function is invoked 100 times. Part (b): The total time complexity is O(n), where n is the number of movements, which is 100 in this specific case. Part (c): The time complexity of the `helper` function is O(nk) where n is the number of movements and k is the constant value used. Therefore, the overall time complexity of the program is O(nk). Part (d): The overall time complexity of this program is O(n). Part (e): The overall time complexity of this program is O(n) because the `helper` function is called 100 times. Part (f): The problem statement requires to implement `helper(i, j, k)`. The execution time of the helper function depends on the number of iterations of the inner loop. Since the `helper` function is called 100 times, and each iteration is dependent on the value of `i` and `j`, the total execution time will be approximately 100 iterations times the time taken to execute a single operation within the loop. Therefore, the time complexity is approximately O(100 * some constant). A more precise calculation would involve analyzing the loop's iteration count but for the sake of a rough approximation, it can be considered O(n).",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "applying",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 20,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Here’s the Analyze the time and space complexity of Breadth-First Search (BFS) and Depth-First Search (DFS) algorithms for traversing a graph, focusing on their implementation and justification. Derive the mathematical expression representing the time complexity of each algorithm. Provide a detailed comparison of their approaches, considering how they handle graph representation and traversal. Specifically, discuss the difference in their memory usage and the potential for recursive calls. For example, consider a graph with 10 nodes and 20 edges. Describe how BFS and DFS would differ in terms of the number of nodes and edges they need to process before reaching a leaf node. Illustrate with a simple example—imagine a connected graph where a path must be found to traverse all the nodes. Justify which algorithm is more suitable for this scenario, considering factors like the presence of cycles or the need to explore all paths.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Stacks",
      "subtopic": "Algorithm Analysis",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The provided code snippet `helper(int i, int j, = k)` calculates a value based on the input `i` and `j`. The function `mystery(int mf int count 0;` iterates through a range of integers `j` from 1 to `i`. Inside the loop, `m count += helper(i, j, k);` repeatedly calls the `helper` function with the same `i` and `j` values, increasing the counter `count`. The `mystery` function is intended to output a result, but the code itself doesn't explicitly show the final output. Given this information, how many times does the `helper` function execute in total within the `mystery` function, and what is the overall time complexity of the `mystery` function's execution? Provide a detailed explanation of your reasoning, including how the `helper` function’s behavior influences the overall execution time.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 20,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are given the head of a singly linked list A consisting of N nodes, where each node contains an integer value and pointer to the next node. The middle node is the exact center for odd-sized lists and second middle for the even-sized lists. You are required to create a function that efficiently finds and returns the value of the middle element of the linked list in a single traversal, without altering the original structure of the linked list. CO2(Applying), 5 IATKS) 4-2} Analyze the time complexity of the function.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Linked Lists",
      "subtopic": "Linked List Analysis",
      "time": 17,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Here’s the Analyze the time and space complexity of Breadth-First Search (BFS) and Depth-First Search (DFS) algorithms for traversing a graph, focusing on their implementation and justification. Derive the mathematical expression representing the time complexity of each algorithm. Provide a detailed comparison of their approaches, considering how they handle graph representation and traversal. Specifically, discuss the difference in their memory usage and the potential for recursive calls. For example, consider a graph with 10 nodes and 20 edges. Describe how BFS and DFS would differ in terms of the number of nodes and edges they need to process before reaching a leaf node. Illustrate with a simple example—imagine a connected graph where a path must be found to traverse all the nodes. Justify which algorithm is more suitable for this scenario, considering factors like the presence of cycles or the need to explore all paths.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Stacks",
      "subtopic": "Algorithm Analysis",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The provided code snippet `helper(int i, int j, = k)` calculates a value based on the input `i` and `j`. The function `mystery(int mf int count 0;` iterates through a range of integers `j` from 1 to `i`. Inside the loop, `m count += helper(i, j, k);` repeatedly calls the `helper` function with the same `i` and `j` values, increasing the counter `count`. The `mystery` function is intended to output a result, but the code itself doesn't explicitly show the final output. Given this information, how many times does the `helper` function execute in total within the `mystery` function, and what is the overall time complexity of the `mystery` function's execution? Provide a detailed explanation of your reasoning, including how the `helper` function’s behavior influences the overall execution time.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 20,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are given the head of a singly linked list A consisting of N nodes, where each node contains an integer value and pointer to the next node. The middle node is the exact center for odd-sized lists and second middle for the even-sized lists. You are required to create a function that efficiently finds and returns the value of the middle element of the linked list in a single traversal, without altering the original structure of the linked list. CO2(Applying), 5 IATKS) 4-2} Analyze the time complexity of the function.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Linked Lists",
      "subtopic": "Linked List Analysis",
      "time": 17,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are tasked with developing a function in C++ to find the middle element of a singly linked list. The linked list has 'N' nodes, where N is an even number. The function should efficiently identify and return the value of the middle node. Assume the linked list is represented as a linked list where each node contains a value (integer) and a pointer to the next node. Implement this function with a time complexity of O(N) and a space complexity of O(1). Describe how you would leverage the provided `head` of the linked list to achieve this efficiently. Provide a minimal, working C++ code example demonstrating the function's functionality, including a test case to illustrate its usage.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Linked Lists",
      "subtopic": "Linked Lists",
      "time": 20,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a linked list containing integers, where each integer represents a student’s score. You are tasked with implementing a function `calculate_average` that efficiently finds the average score of all students in the linked list. The linked list is assumed to have a maximum length of 1000 elements. The function should return the calculated average score. You are not allowed to modify the original linked list. a) Explain, in detail, how you would optimize the `calculate_average` function to achieve a time complexity of O(n), where n is the number of students in the linked list. Justify your choice of algorithm and explain why it achieves this complexity. b) Describe how the provided code snippet would behave if the linked list contains a very large number of elements (e.g., 10000 or more), causing the function to potentially exceed the maximum recursion depth in the provided recursive implementation. What would be the likely performance degradation? c) Assume that you have a linked list with 1000 students. Describe how you would use the `calculate_average` function to determine the average score of all students in the linked list. Provide a step-by-step walkthrough of the execution process, highlighting the critical operations and their respective time/space requirements. Include a discussion of potential performance bottlenecks.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 22,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a 2D sorted matrix representing a map of locations. A key 'C' exists in this matrix if its coordinates (row, column) are within a specific range (inclusive of the top-left corner) and the matrix is sorted in ascending order based on row and column. Describe an efficient searching strategy to determine if ‘C’ exists within this matrix, detailing the steps involved, including a sequence of comparisons. Response Requirements: (a) Suggest a solution to determine if ‘C’ exists, outlining the steps and rationale. Assume the matrix is relatively small. (b) Implement a simple algorithm to check for the existence of ‘C’ using the suggested solution. (c) Analyze the time and space complexity of the implemented algorithm. Derive the mathematical expression for the time complexity.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Mathematics",
      "subtopic": "Searching Strategy",
      "time": 20,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are tasked with implementing a self-balancing binary search tree (BST) in a system where the tree is used to store a collection of integers. The BST is designed to efficiently support a specific query operation – retrieving the element at a given index. The tree structure is expected to maintain a height of no more than 2. Consider the following sorted array: `[4, 5, 6, 7, 8, 9, 10, 11, 12]`. You need to implement a function `insert_element(arr, index, value)` that inserts a new element `value` into the BST at the given `index` while maintaining the BST properties (left subtree contains smaller elements, right subtree contains larger elements, etc.). 1. Explain how the BST's height is maintained during insertion. Describe the core principles involved. 2. Provide a pseudocode implementation of the `insert_element` function. 3. Analyze the time complexity of both the `insert_element` function and the retrieval of an element at a given index after insertion (assume the tree is already fully populated). Consider the potential worst-case scenario of the tree structure. Assume the tree is implemented using a balanced BST structure, and the height is bounded by 2.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Sorting",
      "subtopic": "Bst Implementation",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A pharmaceutical company is developing a new drug to treat chronic pain. They have analyzed the data of 1026 patients, revealing that a specific drug has a 90% success rate in reducing pain compared to a placebo. However, the drug has significant side effects, affecting approximately 10% of patients. The company is now considering a new trial with a larger sample size. Considering the current data, what is the most likely impact of increasing the sample size on the overall success rate of the drug, assuming the side effects remain constant? Justify your answer with a discussion of statistical significance and the potential for error. A. The success rate will increase by 2% due to reduced error in data collection. B. The success rate will increase by 5% due to increased statistical power. C. The success rate will remain unchanged, as the data is already sufficient. D. The success rate will decrease by 3% due to potential for increased reporting errors. Compare and contrast the efficiency of a single-threaded and multi-threaded implementation of a sorting algorithm (e.g., quicksort) in a scenario where the input array is already sorted. Justify which approach offers superior performance for a larger array with numerous elements. Design an algorithm to efficiently detect duplicate entries in a large text file. Explain your chosen algorithm, including its time and space complexity. Derive the mathematical expression for its complexity. Critically evaluate the use of genetic algorithms for solving the Traveling Salesman problem with a population of 1026 individuals. Discuss the potential challenges and limitations of this approach, particularly regarding convergence and solution quality compared to traditional optimization methods. Given a dataset of customer purchase history with 1026 transactions, describe the steps involved in building a customer segmentation model using clustering techniques (e.g., K-means). Explain your approach and analyze its potential to identify distinct customer groups based on purchasing behavior. Considering the constraints of limited computational resources, propose a simplified model for predicting the energy consumption of a small office building based on its occupancy rate, temperature, and time of day. Explain your model’s assumptions and limitations, highlighting the key factors that would need to be considered for improved accuracy.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Algorithms",
      "subtopic": "Algorithms",
      "time": 20,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A team of researchers is developing a new algorithm to predict crop yields based on satellite imagery and weather data. The algorithm analyzes pixel data to identify areas of high and low crop growth. The data set includes 1026 images of different crops across several regions. They’ve determined that the algorithm’s accuracy decreases significantly with larger areas analyzed. Furthermore, the algorithm’s computational time increases linearly with the size of the analyzed area. Based on this, suggest a strategy to optimize the algorithm's efficiency for a specific scenario – e.g., predicting yield for a specific region with a particular crop type – considering the constraints of the 1026 images and the potential impact of increased processing time. Justify your response, highlighting the specific optimization techniques and their expected benefits within the context of the dataset.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Algorithms",
      "subtopic": "Algorithms Optimization",
      "time": 20,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A research team is developing a new drug to treat Alzheimer’s disease. They’ve observed that certain patient groups exhibit a specific pattern of cognitive decline – a decline in episodic memory, particularly during recall of recent events. The drug, ‘NeuroClear,’ is designed to enhance synaptic plasticity, a key mechanism in memory formation. The team suspects that NeuroClear’s mechanism of action directly affects the activity of a particular protein called ‘Synaptic Modulator Alpha’ (SMA). Given this, suggest three specific, plausible experimental approaches you could take to investigate the effect of NeuroClear on SMA activity, providing justification for each approach, considering potential challenges and limitations. What is the primary goal of each approach described above, and why would it be a valuable method for understanding NeuroClear’s effects? Compare and contrast the two approaches (1 & 3) in terms of their method of data collection and their potential impact on the statistical rigor of the study. Justify which approach offers the greater potential for robust and reliable results. Analyze the time complexity of the ‘Data Collection’ phase of the 'Approach 1' method, providing the complexity in terms of number of iterations or steps. Derive the mathematical expression representing this complexity. Design an algorithm/system for analyzing a large dataset of SMA activity levels across a group of Alzheimer's patients, ensuring the algorithm can accurately identify and quantify individual instances of SMA activity fluctuations and report the relevant analysis with detailed explanations. Focus on a method that's practical for a researcher utilizing data sets containing a large volume of information. Critically evaluate the feasibility of using ‘Approach 3’ for analyzing large datasets, considering the potential for data bias and the challenges in accurately interpreting SMA activity fluctuations within the context of the entire Alzheimer’s patient population. Discuss specific limitations and propose improvements to enhance the data analysis. Given the dataset of ‘Alzheimer’s Patients’ data, implement a simplified version of the ‘Approach 1’ algorithm and trace through the execution with examples to demonstrate the process. Specifically, provide examples of how the algorithm would identify patients showing significant SMA activity changes during the recall of recent events.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Algorithms",
      "subtopic": "Algorithms",
      "time": 20,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are tasked with designing an AVL tree data structure to efficiently maintain a sorted list of integers. Given a given list of integers, and the requirement to perform a series of rotations to maintain the AVL property, produce the resulting AVL tree after a series of rotations. Specifically, your task is to: 1. Draw the resulting BST after 5 rotations. 2. Implement a balance factor calculation for each node in the resulting tree after 5 rotations. 3. Describe a specific rotation (Left, Right, or Two's) that will result in a new tree for each of the 5 rotations. The AVL tree's balance factor must be calculated after rotations. Assume the initial AVL tree contains the following values: `[5, 3, 2, 4, 1]`. You must draw the resulting tree after 5 rotations. Consider the Quick Sort algorithm with the last element being selected as the pivot. Present a detailed description and example of each rotation you will implement to achieve the result, including the corresponding node labels.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Trees",
      "subtopic": "Tree Rotations",
      "time": 20,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The provided text details the implementation of a binomial heap, a data structure designed for efficient merging of sorted arrays. Consider the task of creating a balanced binary tree, specifically a 'k-ary tree' representing a sorted list of `K` elements. Describe, in detail, the fundamental operations required to construct this tree. Specifically, outline the 'insert' operation, justifying its implementation within the context of maintaining a balanced tree. Explain how you would handle a scenario where the input array `K` has a size of 8 elements. Furthermore, briefly discuss the time and space complexity associated with the insertion operation, assuming the tree structure is maintained after each insertion. Assume the tree represents the 'k-ary representation' of the array.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Sorting",
      "subtopic": "Tree Construction",
      "time": 20,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The provided text details a search for the existence of all possible pre-positions of digit ‘f’ within a given string. Consider the scenario of searching for the presence of the ‘f’ in the string “122”. Explain, in detail, the process you would employ to accomplish this search, including the steps you would take, and justifying your chosen methodology. Specifically, discuss the potential challenges you might encounter during the search and how you would mitigate them. Provide a step-by-step breakdown of how you would execute this search using a suitable data state, detailing the logic behind each stage. Assume the input string is ‘122’ and the goal is to determine if ‘f’ appears as a pre-position within the string. Provide the output as ‘True’ or ‘False’ based on the input string.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Searching",
      "subtopic": "Searching",
      "time": 25,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The provided text describes the best suitable data state for finding all possible pre-positions of digits in a ven string. Consider the scenario of searching for prepositions of 'the' within the string \"122\". Analyze the process involved in identifying potential prepositions and justify why the `len` approach is the most suitable. Specifically, explain how the method would handle variations in the string's length and potential presence of multiple prepositions. Provide a detailed outline of the search process, including how you would efficiently handle overlapping or identical prepositions. Assume you need to generate all possible pre-positions of 'the' within the string \"122\" to determine if it's suitable for the dictionary.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Searching",
      "subtopic": "Searching",
      "time": 24,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider designing a system to efficiently manage a library’s collection of books. The library has a growing collection of approximately 1000 books, each with a unique ISBN and a `publication_year` field. You need to implement a mechanism to efficiently search for books based on title and author. Describe a layered approach to this system, detailing the roles of each layer and how the data would be organized. Specifically, how would you handle the addition of new books and the update of existing book information (e.g., ISBN, publication year) compared to searching for books using ISBN? Justify your design choice, considering factors like scalability and maintainability.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A hospital is implementing a new patient triage system. The system uses a flowchart to assess patients based on their symptoms. The flowchart has three distinct branches: “Mild,” “Moderate,” and “Severe.” The system prioritizes patients in the “Mild” branch first. A patient in the “Mild” branch is assessed by a nurse using a standard questionnaire. If the nurse deems the patient stable, they are automatically entered into the “Moderate” branch. If the nurse determines the patient is severely ill, they immediately enter them into the “Severe” branch. The nurse has a limited time (30 minutes) to complete the assessment. The goal is to minimize the number of patients needing urgent medical attention. What is the most efficient way to design a triage workflow that balances patient safety and hospital operational efficiency, considering the limited time available to the nurse? Compare and contrast the strengths and weaknesses of implementing a fully automated triage system versus a hybrid system that incorporates human oversight and a pre-defined set of criteria. Justify which approach is more suitable for a busy hospital setting with a high volume of patients. Analyze the time and space complexity of a simple shortest path algorithm implemented in Python, considering the potential for optimizations like using a Trie data structure for prefix searching. Derive the mathematical expression for the time complexity in terms of the number of nodes traversed. Design an algorithm to sort a list of integers in ascending order efficiently. Explain your chosen sorting algorithm and its time/space complexity. Provide an example implementation in Java. Critically evaluate the use of machine learning for predicting patient readmission rates. Discuss potential biases in the data and how they could impact the accuracy of the predictions. Suggest three potential strategies to mitigate these biases. Given a dataset of patient records including age, gender, diagnosis, and treatment history, implement an algorithm to identify patients at high risk of developing a specific chronic disease (e.g., diabetes) based on a combination of factors. Explain your approach and analyze its efficiency (time and space complexity). Here's a scenario: A small business is experiencing a significant increase in customer inquiries regarding a new product feature. The support team needs to quickly triage these inquiries to determine the most appropriate level of assistance. Design a system that effectively categorizes these inquiries based on the feature's complexity and the customer's expressed needs. Consider the importance of rapid response time and potential for escalation.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Algorithms",
      "subtopic": "Algorithms",
      "time": 25,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A telecom company wants to distribute SIM cards to different cities of a state. Since the cities are connected directly/indirectly, for the SIM card distribution the company first decided to compute the minimum cost of traveling between all cities using a weighted graph G(V,E,w). Where V represents the city number, E represents the edges (connections) between different cities and w is the cost of travelling from one city to another. Your task is to determine the shortest path for each vertex pair in the weighted graph G(V,E,w). Write the function to compute the final cost of each vertex pair. [7] (a) Briefly outline a general approach to minimizing the total travel cost for all SIM card distribution scenarios within a weighted graph, considering the core logic of the algorithm. (b) Describe the role of the 'cost' parameter 'w' within the graph G(V,E,w), explaining why it’s crucial to consider it when determining the minimum cost. (c) Assuming the graph G(V,E,w) has a total of 10 cities (V=1 to 10), provide a concise, step-by-step implementation of your function in pseudocode or Python. Specifically, show how the function would calculate the shortest path cost for each pair of cities (v, w) where v is a city and w is the distance between them. Justify your choice of approach considering efficiency.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Graphs",
      "subtopic": "Graphs And Shortest Paths",
      "time": 20,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Analyze the time and space complexity of AVL tree insertion and deletion operations in the context of maintaining a balanced tree structure. Derive the mathematical expression representing the time complexity for a balanced AVL tree insertion and deletion operation with a given node value. Consider the worst-case scenarios and provide a justification for the chosen complexity analysis. Specifically, discuss the impact of the height of the tree on performance.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Trees",
      "subtopic": "Trees Complexity Analysis",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The Master Theorem provides a method for solving recurrence relations. Given the recurrence relation: `8T(n/2) + 1000n*`, compute the values of T(n) and f(n) for n = 0 to 10. Justify your approach, clearly stating the theorem used and demonstrating the calculation of T(n) and f(n) for each value of n. Furthermore, explain why the specific asymptotic notations chosen (e.g., using `n!` or `log(n)`) are appropriate for the calculations.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Mathematics",
      "subtopic": "Recurrence Relations",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A large e-commerce company, \"ShopSphere,\" is developing a new personalized recommendation engine to increase sales. They have a dataset of 100,000 user profiles and 50,000 product catalog entries. The goal is to suggest products to users based on their past purchases and browsing history. They’ve chosen a collaborative filtering approach. Implement a basic recommendation algorithm that suggests 3 products to a user based on their recent purchase history. Justify your chosen approach and explain how you’d ensure this algorithm's performance for a reasonably large dataset. Consider how you’d handle cold-start problems (new users or products with little interaction data). Now, compare and contrast the use of collaborative filtering versus content-based filtering to generate product recommendations within a retail setting. Justify which approach would be more suitable for ShopSphere, considering the available data and potential user preferences. Analyze the time complexity of a simple collaborative filtering algorithm that computes the similarity between user-item interaction matrices. Derive the mathematical expression representing the similarity score (e.g., Pearson correlation). Explain why this mathematical expression is a reasonable indicator of similarity. Design an algorithm to recommend movies to users based on their viewing history. Explain your approach and analyze its efficiency, considering the potential for users to consume multiple movies per viewing session. Critically evaluate the use of weighted averaging as a technique for combining user-item similarity scores in collaborative filtering. Discuss its strengths and weaknesses, considering scenarios with highly variable user preferences and the potential for bias. Given a dataset of customer reviews for a new smartphone, identify three key positive and three key negative themes. Implement a simple method (e.g., keyword analysis or sentiment scoring) to categorize the reviews into these themes. Trace through the execution of your chosen method and provide a concise summary of the extracted themes and their significance for product development.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Algorithms",
      "subtopic": "Algorithms",
      "time": 20,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A large retail chain, \"Global Goods,\" is considering expanding its online presence. They have a large inventory of diverse products across multiple categories. Currently, they rely on a single, centralized warehouse for fulfillment. To optimize operational costs and improve customer satisfaction, they propose a phased rollout of an e-commerce platform, initially focusing on a subset of their most popular product categories – ‘Apparel’ and ‘Electronics’ – across a single geographical region (North America). The initial phase will involve a phased migration strategy, starting with a pilot program in one city and scaling to other locations based on performance data. Critically, the pilot program will heavily emphasize localized customer support and supply chain integration. What is the most crucial risk associated with implementing this phased rollout strategy, considering the potential for operational bottlenecks and customer dissatisfaction across different regions? Analyze the time/space complexity of the “Depth-First Search” algorithm used for pathfinding in a large graph representing a social network, detailing the steps involved and identifying the dominant operations. Design an algorithm/system for optimizing inventory replenishment for a small, rapidly changing product assortment, considering factors like demand forecasting, lead times, and storage costs. Explain your approach and analyze its efficiency using a reasonable complexity analysis. Critically evaluate the use of 'Machine Learning' for predicting customer churn within an e-commerce business, considering the available data (purchase history, website activity, demographics). Discuss the potential biases in this approach and suggest strategies for mitigating them. Given a dataset containing customer reviews for a mobile app, identify the key sentiment categories (e.g., positive, negative, neutral) and determine the most frequent sentiment associated with each category. Present your findings in a concise report, with a clear explanation of the methods used. Imagine you are developing a system for a cloud-based data analytics service. Design the key components of this system (data ingestion, storage, processing, visualization) and explain how they contribute to the overall value proposition.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Algorithms",
      "subtopic": "Algorithms",
      "time": 25,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A small, rural hospital is experiencing a significant backlog of patients due to a recent viral outbreak. The hospital’s existing patient registration system primarily relies on paper forms, leading to delays in patient identification and appointment scheduling. The head of the hospital, Dr. Evans, has tasked you with designing a new system to streamline the process. (a) Suggest three potential solutions to address the patient registration bottleneck, detailing the rationale behind each choice, considering factors like cost, scalability, and user experience. (b) Implement a simplified version of the proposed system using a basic flowchart, illustrating the patient registration flow from initial intake to appointment confirmation. (c) Analyze the time complexity of the flowchart you’ve created (approximately 100 steps) considering the different operations involved (e.g., data validation, form submission, database updates). Derive the mathematical expression representing the time taken for the entire process.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Algorithms",
      "subtopic": "Patient Registration Workflow",
      "time": 20,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a k-ary tree with 40 nodes. You want to implement a hash function `h(t) = t n`, where `n` is the number of nodes in the tree. What is the minimum and maximum height of a k-ary tree with 40 nodes, assuming the hash function distributes keys uniformly? Justify your answer, considering the implications of the hash function’s output on tree structure.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Hash Tables",
      "subtopic": "Hash Functions",
      "time": 25,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A large retail company, \"Global Goods,\" is experiencing a significant drop in customer loyalty due to a recent shift towards online shopping. They have identified that customers who primarily purchase through mobile apps are significantly more likely to abandon their carts. To address this, Global Goods has decided to implement a personalized recommendation system based on past purchase history and browsing behavior. (a) Suggest three distinct approaches to building a personalized recommendation system for Global Goods, detailing the pros and cons of each approach in terms of scalability and complexity. (b) Implement a simple collaborative filtering recommendation system using the data available on Global Goods’ mobile app users. Describe how you would identify similar users and generate recommendations. (c) Analyze the time complexity of the collaborative filtering algorithm you've implemented. Derive the mathematical expression representing the computational cost. --- (a) The approach of implementing a rule-based system (e.g., recommending items similar to those purchased in the last 30 days) offers relatively low complexity but struggles with long-term personalization and might require significant manual intervention for adaptation. A more scalable approach could involve utilizing a hybrid model combining collaborative filtering with content-based filtering, utilizing user-defined attributes (e.g., demographics, purchase history), and employing a reinforcement learning algorithm to dynamically adjust recommendations based on user feedback. However, the hybrid approach’s complexity is higher. (b) For a collaborative filtering implementation with 1000 users, the time complexity of identifying similar users using k-Nearest Neighbors (k-NN) would be O(nki) where n is the number of users, k is the number of neighbors, and i is the number of iterations. Generating recommendations based on these similarities would require querying the database for similar users, which would typically take O(nk) time. Therefore, the overall time complexity would be O(nki + nk) which simplifies to O(nk) assuming k is reasonably small. The scalability will be limited by the database query performance. (c) The time complexity of the collaborative filtering algorithm’s matrix factorization can be analyzed as follows: The matrix factorization process involves solving a linear equation with a large number of parameters (e.g., the Christofides algorithm or a similar method). The number of equations to solve depends on the number of users and the dimensionality of the latent features. In a simplified scenario where we have two latent variables (user and item), the complexity is approximately O(nm), where n is the number of users and m is the number of latent features. The computational cost will depend heavily on the algorithm used, but can be significant for large datasets and high-dimensional feature spaces. Further, the computation time increases as the number of features increases.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Algorithms",
      "subtopic": "Algorithms",
      "time": 25,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a scenario where counting sort, a key component in radix sort, is replaced by a quick sort. Does this substitution inherently impact the correctness or working of radix sort? Justify your answer in terms of correctness/working, not solely in terms of time complexity. CO2: When can double hashing become and behave like linear probing? Provide a detailed explanation of the factors that lead to this behavior. CO4: In a merge sort array is divided into two equal parts. What recurrence relation will the algorithm follow if the array is divided into five equal parts? CO5: Design an algorithm/system for optimizing the storage and retrieval of a large collection of data, specifying the steps involved and analyzing its efficiency – consider potential challenges and limitations. CO6: Critically evaluate the use of hash tables in data structures. Discuss the advantages and limitations of hash tables in relation to other data structure approaches, and propose a scenario where a hash table might be a more suitable choice than other alternatives.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Sorting",
      "subtopic": "Algorithm Design & Analysis",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are tasked with designing a system for analyzing customer reviews for a newly launched online clothing retailer. The retailer relies solely on textual data from customer reviews and lacks the ability to utilize any pre-built data structures like arrays or linked lists for efficient processing. Describe a pragmatic approach to building a system to extract key insights from these reviews, focusing on sentiment analysis and identifying recurring themes. Specifically, outline the steps you would take, justifying your choices regarding the data structures and techniques you would employ, considering the limited resources. Assume the reviews are relatively unstructured and contain varied writing styles.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Trees",
      "subtopic": "Sentiment Analysis & Themes",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you are tasked with designing an efficient algorithm to sort a large stream of customer data – names, addresses, purchase history, and demographics – efficiently. The data stream is constantly increasing, and you need to maintain the sorted order of these attributes. Describe, step-by-step, three distinct sorting algorithms you could employ, detailing their time and space complexities, and justify which you would choose for a specific scenario, explaining why your choice is preferable to the others. For each algorithm, provide a concise, illustrative example of how it would be applied to a small subset of the data.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A hospital is implementing a new system to streamline patient registration. The system requires patients to input their medical history and allergies. The current process involves manual data entry for each patient, taking approximately 15 minutes per patient. The new system will automate this process using a flowchart. What is the optimal strategy to minimize the total time taken to register a patient using the new system, considering the potential for data inconsistencies and errors? (a) Implement a phased rollout, starting with a small group of patients to identify potential issues before expanding. (b) Utilize a pre-populated patient database with known allergies to reduce manual data entry, assuming a low rate of data changes. (c) Design the flowchart with explicit error handling and validation checks to mitigate data inconsistencies and prevent errors, even if it increases the initial processing time. Justify your answer with a detailed explanation of how the flowchart minimizes the risk of errors and the impact on time efficiency. (2 marks) Compare and contrast the use of a relational database versus a NoSQL database for storing patient medical history, focusing on their strengths and weaknesses when dealing with large volumes of patient data and frequent updates. Justify your answer, focusing on the specific operational requirements of patient records (e.g., data type, access patterns, scalability) – provide examples of scenarios where one database type would be more appropriate than the other. (3 marks) Analyze the time/space complexity of Dijkstra's shortest path algorithm when searching for the shortest route between two nodes in a graph. Derive the mathematical expression representing its time complexity. (2 marks) Design an algorithm to determine if a given sequence of integers represents a valid Sudoku puzzle. Provide pseudocode or a brief description of the algorithm’s steps and its time complexity. (3 marks) Critically evaluate the use of caching mechanisms in a web application. Discuss the potential advantages and disadvantages of caching, considering factors such as latency, scalability, and data consistency. Suggest two specific scenarios where caching would be particularly beneficial, and explain why. (1 mark) Given a dataset of customer purchases with columns 'CustomerID', 'PurchaseDate', 'Amount', and 'ProductCategory', implement a simple algorithm to identify the top 5 most frequently purchased product categories. Provide the output format (e.g., a list) of the results.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Algorithms",
      "subtopic": "Algorithms",
      "time": 25,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The provided abstract data structure (ADT) involves a Depth-First Search (DFS) traversal of a stack. You are tasked with implementing a version of DFS that utilizes a Linked List to represent the stack. Specifically, you need to implement the following operations: (a) Implement a function `dfs(stack, start_index)` that takes a stack and a starting index as input. The function should perform a DFS traversal starting from the given `start_index` and return a list of the elements visited in the order they were popped from the stack. The list should be sorted in ascending order. (b) Implement a function `delete_element(stack, index)` that deletes an element from a stack at a given index. The function should return `true` if the element was successfully deleted, and `false` otherwise. (c) Implement the non-recursive version of DFS using code written in a linked list for the ADT. Focus on the core DFS logic – visiting nodes and exploring adjacent nodes. Consider the following example abstract data structure: ``` Stack: [1, 2, 3, 4, 5] Start Index: 0 ``` How would you implement the `dfs` function to explore the stack starting from index 0?",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Trees",
      "subtopic": "Dfs And Linked Lists",
      "time": 20,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a city network where each city can be connected to up to three other cities. The goal is to maximize the number of cities that are directly connected to each other. You are given a set of city numbers (1 to 8) and a list of possible connections (e.g., {1, 2, 3}). Your task is to design a dynamic programming solution to achieve this maximum connectivity. a) Propose an efficient dynamic programming algorithm to find the maximum number of cities that can be connected. Clearly state the dynamic programming table, the recurrence relation, and the base case. b) Apply the proposed algorithm to the example: {1, 2, 3, 4, 5, 6, 7, 8}. Print the city numbers that can be connected with a flyover (i.e., can be directly connected to each other). c) Analyze the space and time complexity of your proposed solution for n cities (where n = 8). Provide a mathematical expression representing the time complexity (e.g., O(n^2)). Describe how you would optimize the algorithm for larger values of n (e.g., using memoization or tabulation).",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The problem is to design a system for efficiently mapping a network of cities on a riverbank, where each city on one side of the river can be connected to each city on the other side with flyovers. The challenge lies in minimizing the number of flyovers while maintaining the constraint that no two flyovers intersect. Consider a river with 8 cities on the left bank and 8 cities on the right bank. The goal is to create the most optimal connection network. a) Propose an algorithm to determine the maximum number of flyovers possible, given the constraints of the river network and the requirement that no two flyovers intersect. Provide pseudocode outlining the algorithm's steps. b) Implement a simplified version of the proposed algorithm using a simple graph data structure (e.g., adjacency list) to demonstrate its core functionality. Focus on representing the network and calculating the maximum number of flyovers within a reasonable time complexity. c) Analyze the time complexity of the proposed algorithm. Derive the mathematical expression representing the time complexity of the algorithm using the graph representation. Explain why this complexity is appropriate for the problem’s scale.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Algorithms",
      "subtopic": "Algorithms",
      "time": 20,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Analyze the complexity of different algorithms using asymptotic analysis.  Implement various linear and non-linear data structures and their related operations. CO3. Select and apply relevant data structure for a given problem and evaluate its performance. CO4. Select and apply appropriate algorithmic design technique (Greedy, backtracking, Divide and Conquer, DP) for solving a given problem and evaluate the solution. QI. Solve the following problem: Given a sorted array of integers, find the index of the first occurrence of a target integer in the array. Justify your chosen approach’s time complexity. CO2. Implement the quicksort algorithm with a pivot selection strategy that minimizes the number of recursive calls. Compare the performance of quicksort with the implementation of a merge sort for an array of size 1000. Analyze the space complexity of your merge sort implementation. CO3. Design a system for efficiently managing a library with a collection of books. The system should handle adding new books, searching for books by title and author, and tracking book availability. Describe the data structures you would use and justify their selection based on the requirements (e.g., efficient search, retrieval, and organization of data). CO4. Implement a Breadth-First Search (BFS) algorithm to find the shortest path between two nodes in a graph. Provide pseudocode and explain the logic behind the algorithm. Discuss the time complexity of your BFS implementation, and how it compares to a Depth-First Search (DFS) implementation for the same problem. QI. Consider a scenario where you need to find all the distinct sequences of digits in a given number. Implement a solution using a greedy algorithm. Analyze the time complexity of your greedy solution – provide a mathematical expression of its complexity. Explain why this approach is not optimal for this specific task.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 18,
      "source_file": "Generated_Questions"
    },
    {
      "question": "Determine whether and how dynamic programming can be utilized to efficiently find the longest common subsequence (LCS) between the sequences “STONE” and “LONGEST”. Justify your answer with a detailed explanation of the DP approach and its applicability to this specific problem. Detail the steps involved in implementing the dynamic programming algorithm to calculate the LCS.",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Dynamic Programming",
      "subtopic": "Dynamic Programming",
      "time": 16,
      "source_file": "Generated_Questions"
    },
    {
      "question": "Consider a scenario where you are designing a system to analyze a large dataset of customer transactions. Each transaction represents a pair of customer and item purchased. The dataset contains 10,000 transactions. You need to determine the shortest path distance between every pair of vertices (customers and items) in this dataset. Specifically, compute the total cost associated with each pair of vertex (customer and item) after the graph traversal. Your function should handle edge cases gracefully, such as empty datasets or datasets with only one pair of vertices. The function should return a list of all the total costs. Provide a step-by-step solution to this problem, clearly illustrating the algorithm's logic. Assume a graph representation where the vertices are customers and items. The edges represent transactions and their associated costs. The cost between two vertices is defined as the total amount of money exchanged in that transaction. Consider the following example: {1, 2} represents the transaction where customer 1 buys item 2 and customer 2 buys item 1. Show the computations at each step. Part A: Algorithm Design & Solution (1 mark) Outline your approach to efficiently calculate the total cost of all pairs of vertex combinations. Describe the core steps you would take. Indicate how you would handle the edge case of an empty dataset. Part B: Detailed Implementation (1 mark) Implement a function `calculate_total_costs(transactions)` that takes a list of transactions as input and returns a list of all the total costs. The function should: 1. Handle the case where the input list is empty or contains only one transaction. 2. Sort the transactions based on the number of items purchased in each transaction. 3. Calculate the total cost for each pair of vertices (customer and item). 4. Return a list of all the calculated total costs. Part C: Spurious Hits & Rabin-Karp (3 marks) A \"spurious hit\" is a matching hash value that is equal to a real hash value but is not the actual match in the text. The Rabin-Karp algorithm is used for pattern searching. When the pattern `P` is `26` in the text `T` (which is `3141592653589793`), and the base value `q` is `11`, and the text `T` is generated as: `T = 3141592653589793` and the pattern `P = 26`, then how many spurious hits are expected, assuming a good hash function? Provide a justification for why the number of spurious hits might be high. Explain the concept of hash collisions and how they occur in the Rabin-Karp algorithm. How does the code written for the spurious hits case impact the overall performance?",
      "marks": 5,
      "difficulty": "hard",
      "cognitive_level": "evaluating",
      "topic": "Graphs",
      "subtopic": "Graphs",
      "time": 21,
      "source_file": "Generated_Questions"
    }
  ],
  "2_mark": [
    {
      "question": "Consider a binary search tree where each node’s height is approximately 2.5 times its depth. Describe how the number of rotations required during a balanced search operation in this tree will be affected by the node’s depth and the tree’s structure. Provide a mathematical formula representing the relationship between rotation count and depth if possible.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Searching",
      "subtopic": "Tree Structure Analysis",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A B-Tree is designed to efficiently store and retrieve data with a logarithmic worst-case lookup time. Describe how the tree structure ensures this logarithmic performance, highlighting the key characteristics that contribute to the optimization. (2 marks)",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Trees",
      "subtopic": "Tree Structure Optimization",
      "time": 4,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Analyze the time/space complexity of a binary search tree and derive the mathematical expression representing its worst-case performance. Justify which is better for scenarios involving frequent insertions and searches.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Searching",
      "subtopic": "Time/Space Complexity Analysis",
      "time": 4,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Given an unsorted array of N elements, where each element is unique except for one element that appears at least twice, devise an algorithm to efficiently find the intersection of the array, minimizing the number of comparisons. Justify your chosen algorithm and describe the data structures used to facilitate efficient intersection operations. Provide an example of how the algorithm would handle a scenario with N=10 and the element E = 10.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Sorting",
      "subtopic": "Algorithm Design",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A student is designing a system to automatically categorize incoming emails into different categories (e.g., Spam, Important, Marketing, etc.). The system currently uses a rule-based approach – if the subject contains “urgent” AND the sender is “Microsoft”, it’s flagged as Urgent. How can you redesign this system to improve its accuracy and scalability while minimizing the need for manual intervention? Provide a detailed explanation of your redesign, detailing the changes you would make and justifying each step.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Algorithms",
      "subtopic": "Automated Categorization",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a 2D array representing a hierarchical structure, where each element is a node. The 'parent' field in the array indicates the parent node for a given node. You are given a 2D array, `2DA`, representing the hierarchical structure of the HS. Identify the node (label) in the array that has the maximum number of direct and indirect parent-child relationships. Provide a concise explanation of your reasoning.",
      "marks": 2,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Computer Networks",
      "subtopic": "Hierarchical Structure Analysis",
      "time": 7,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A large dataset of customer reviews is being analyzed to identify the most frequently discussed topics. The data is represented as an array of strings, where each string represents a review. You need to quickly determine which topics are most prevalent. What is the most efficient algorithm to achieve this, considering the size of the dataset and the need for speed? Justify your choice with a suitable data structure.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "understanding",
      "topic": "Searching",
      "subtopic": "Algorithm Design",
      "time": 8,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you have a sorted array of numbers, and you need to find the index of a specific number within the array. Describe an efficient algorithm using a suitable data structure to accomplish this task, providing a step-by-step explanation. Illustrate with a concrete example (e.g., an array of integers).",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Searching",
      "subtopic": "Searching Algorithms",
      "time": 8,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A small bakery specializes in custom cake designs. They need to create a cake for a birthday party – a large, round cake for approximately 50 guests. They want the cake to have a unique, swirling pattern of chocolate and vanilla frosting, and the overall design should resemble a stylized, oversized flower. Considering these constraints, which of the following is the MOST appropriate method for creating this complex design with minimal waste of frosting? (a) Using a pre-made cake stencil with a simple floral pattern and then applying frosting to it. (b) Creating the design layer by layer, starting with a base of chocolate frosting and gradually adding vanilla, ensuring the swirl effect is achieved with each layer. (c) Employing a digital design tool to create a complex pattern, then manually transferring it to the cake, resulting in a slightly less visually dynamic outcome. (d) Employing a single color frosting that can be layered and blended to create the swirling effect.",
      "marks": 2,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Algorithms",
      "subtopic": "Cake Design & Frosting",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are given the head of a singly linked list A consisting of N nodes, where each node contains an integer value and pointer to the next node. The middle node is the exact center for odd-sized lists and second middle for the even-sized lists. You are required to create a function that efficiently finds and returns the value of the middle element of the linked list in a single traversal, without altering the original structure of the linked list. CO2(Applying), 5 IATKS) 4-2} Describe the time complexity of this function, considering the worst-case scenario and typical operations, and explain why it’s considered efficient.",
      "marks": 2,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Linked Lists",
      "subtopic": "Linked List Operations",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider the infix expression `((a+b)*c) - d`. Perform the conversion into postfix notation, demonstrating the stack’s role in each operation. Explain the logic behind each step. Q2: A palindrome checker utilizes a stack and a queue. Explain the key differences in data access mechanisms (e.g., how the stack and queue handle elements) between these two approaches, considering potential performance implications.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Stacks",
      "subtopic": "Stacks & Operations",
      "time": 8,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you are designing a system to track the popularity of different types of books in a library. The library has a large collection of books, and you need to determine which book genres are most frequently borrowed. Describe three different linear data structures that could be used to represent this data, outlining their advantages and disadvantages in terms of space and time complexity for handling a moderately sized collection (e.g., 1000 books). For each structure, briefly explain how the data structure would be used to store the book information (e.g., title, author, genre, number of borrowed copies) and demonstrate how a simple operation like retrieving the top 5 most borrowed genres would be implemented using the chosen data structure.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 8,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are given the head of a singly linked list A consisting of N nodes, where each node contains an integer value and pointer to the next node. The middle node is the exact center for odd-sized lists and second middle for the even-sized lists. You are required to create a function that efficiently finds and returns the value of the middle element of the linked list in a single traversal, without altering the original structure of the linked list.Describe the time complexity of this function, considering the worst-case scenario and typical operations, and explain why it’s considered efficient.",
      "marks": 2,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Linked Lists",
      "subtopic": "Linked List Operations",
      "time": 5,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider the infix expression `((a+b)*c) - d`. Perform the conversion into postfix notation, demonstrating the stack’s role in each operation. Explain the logic behind each step. Q2: A palindrome checker utilizes a stack and a queue. Explain the key differences in data access mechanisms (e.g., how the stack and queue handle elements) between these two approaches, considering potential performance implications.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Stacks",
      "subtopic": "Stacks & Operations",
      "time": 8,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you are designing a system to track the popularity of different types of books in a library. The library has a large collection of books, and you need to determine which book genres are most frequently borrowed. Describe three different linear data structures that could be used to represent this data, outlining their advantages and disadvantages in terms of space and time complexity for handling a moderately sized collection (e.g., 1000 books). For each structure, briefly explain how the data structure would be used to store the book information (e.g., title, author, genre, number of borrowed copies) and demonstrate how a simple operation like retrieving the top 5 most borrowed genres would be implemented using the chosen data structure.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 0,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A hiker is traveling through a mountain range. They need to traverse a certain distance, and they have a limited amount of fuel. The hiker can only travel a maximum of 'n' units per day. They must choose the shortest path to reach their destination, considering the distance covered by each possible route. Describe the algorithm to find the shortest path and analyze its time complexity. Assume the hiker can only travel in one direction. Explain why the time complexity is O(n).",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A singly linked list has `N` nodes. The second middle node for odd-sized lists is the exact center for odd-sized lists. You are given a singly linked list and need to efficiently identify and return the value of the middle element of this list. Provide a pseudocode implementation of your solution. Justify your approach, highlighting the time and space complexity of your solution.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Linked Lists",
      "subtopic": "Linked Lists",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "How does the stack and queue data structures differ in terms of their mechanisms for processing even numbers, and what are the key processing steps involved in implementing a palindrome checker using both approaches? Provide an example demonstrating the efficiency of each approach for checking a simple palindrome.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Stacks",
      "subtopic": "Stack And Queue Processing",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A 2D sorted matrix is provided containing both positive and negative numbers. Determine, in O(n) time, whether the key '22' exists within this matrix, using a specific search strategy. Justify your chosen strategy's efficiency considering the sorted nature of the matrix. Outline the sequence of comparisons performed.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Mathematics",
      "subtopic": "Matrix Search Strategy",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a scenario where you are building a system to recommend products to users on an e-commerce platform. The e-commerce platform has a large catalog of products with varying attributes (e.g., price, category, brand, features). You want to prioritize recommending products that are highly relevant to a user’s past purchase history and browsing behavior. Describe, in detail, how you would utilize a modified version of the QuickSort algorithm to efficiently partition a list of products based on their price, ensuring that the products with the lowest prices are placed towards the front of the list. Justify your choices in terms of time and space complexity. Assume you have a dataset of 10,000 products. Assume the products are sorted in ascending order by price.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Sorting",
      "subtopic": "Sorting",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are designing a system to analyze customer reviews for a new online bookstore. The reviews are presented as a list of strings, each string containing a customer’s text review. The reviews are known to contain a significant number of irrelevant words (e.g., \"the\", \"a\", \"and\") that don’t contribute to the core meaning of the review. The goal is to identify and rank the reviews based on their relevance to the main topic of the review. Assume the p uniformly at random. The probability that the pivot element get placed in the worst possible location in the d off to 2 decimal places) CO3,Apply (Level-3) , 2 -Marks] of the portioning (roun BF Given two string X and Y, the task is to find the Longest Common Subsequence (LCS) between them Dynamic programming X= ABCBDAB Y= BDCABB CO4 Apply (Level-4), 4 Mai a ine which ith Consider the algorithm that optimize [COS, Analyze (Level-4) 3-Mark] ivot element is chosen Describe the algorithm you would implement to identify and rank reviews based on their relevance to the main topic of the review, considering the probability of a pivot element being placed in the worst possible location. Justify your choice of algorithm and explain how it addresses the challenge of irrelevant words. Specifically, discuss the key steps involved in your solution.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Sorting",
      "subtopic": "Relevance Analysis",
      "time": 13,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a scenario where you are designing a system to analyze customer feedback on a product. The feedback consists of a series of text reviews, each with a numerical rating (1-5 stars) and a brief textual description. You have a limited amount of memory to store these reviews. What is the most efficient algorithm to identify the top k reviews with the highest average rating, considering both rating and textual description, minimizing memory usage? Explain your chosen algorithm, detailing its time and space complexity.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Sorting",
      "subtopic": "Algorithm Design",
      "time": 13,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Given the Quick Sort algorithm, how does the selection of the last element as the pivot affect the number of swaps required during the algorithm’s execution, specifically considering the time complexity? Explain the relationship between the pivot selection and the number of swaps in the worst-case scenario. Provide a concrete example using a small array of size 5.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Sorting",
      "subtopic": "Sorting And Swaps",
      "time": 13,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A pharmaceutical company is developing a new drug to treat a rare autoimmune disease. The drug requires a series of chemical reactions involving multiple steps and precise timing. The initial reaction sequence involves 3615 steps. It is determined that the first two steps take 10 minutes each, the next three steps take 5 minutes each, and so on, with a constant ratio of 10 minutes to 5 minutes. The total time required for all reactions is 3615 minutes. What is the minimum number of reactions required to complete the synthesis of the drug, assuming each reaction can be completed independently?",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Algorithms",
      "subtopic": "Reaction Sequencing",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Given an AVL Tree, after removing the 5th node, the resulting BST is constructed. Label each node in the resulting tree with its balance factor. Then, apply a Quick Sort algorithm with the last element selected as the pivot. Draw a new tree for each rotation that occurs during the Quick Sort process. Explain the impact of each rotation on the tree's structure. PART A (1 mark): Briefly explain the concept of a balance factor and how it's calculated within an AVL Tree. PART B (1 mark): Describe the initial steps of the Quick Sort algorithm – specifically, how it selects a pivot and sorts the sub-array. PART C (1 mark): Provide a textual representation (simplified, not detailed) of one rotation that occurs during the Quick Sort process when the pivot is the last element of the subtree. Illustrate the changes that occur with this rotation.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Trees",
      "subtopic": "Trees Rotation Analysis",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a graph G = (V = {V1, V2, V3}, E = {V1, V2, V3, V4}) where V = {1, 2, 3} and E = {1, 2, 3, 4}. Explain, justifying with a brief algorithmic description, how you would use a Depth-First Search (DFS) algorithm to find the Minimum Spanning Tree (MST) of G. Justify why DFS is suitable for this particular graph setup.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Graphs",
      "subtopic": "Algorithms",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A city planning department is tasked with designing a new park layout to maximize recreational space while minimizing construction costs. They have a limited plot of land and require a balance between green space and accessibility. The park should include a designated walking path, a children’s play area, a seating area for relaxation, and a small grassy area for picnics. Specifically, the design must incorporate a tiered approach, starting with a central pathway, followed by a series of smaller, interconnected zones, and ending with a larger, open grassy area in the center. How would you approach this design, considering the constraints of limited space and cost? B: Binary search is an algorithm used to efficiently locate a specific value within a sorted list. In the context of image processing, imagine you have an image containing many pixels, and you need to find the pixel with the maximum red value. Describe the steps involved in binary search, explaining how it guarantees finding the maximum red value within the image. C: A large database contains information about customer transactions. The database is structured as a relational model, with tables for customers, orders, and transactions. The relationship between the tables is that a customer can place multiple orders, and each order has a timestamp. Analyze the time complexity of a typical query to retrieve all customers who placed an order within the last 7 days. Explain your reasoning and provide the time complexity in terms of the number of records processed.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Algorithms",
      "subtopic": "Algorithms",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you are building a system to manage library books. A student needs to quickly check if a book is available or not. Describe the key operations required for this task, using only 'element' and 'decree' operations. Provide a practical example of how you would implement this using these operations in a simplified scenario.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Algorithms",
      "subtopic": "Algorithms",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A dermatologist wants to represent a list of his patients record by their (UID). ror each patient, he would like to mork whether patient is a Male or Female. Suggest a data structure that supports the following operations in O(N) time in the worst case, Where N is the number of patients (Male and Female) in the data structure when following operations are executed. (a) Insert(p,c) -Insert a new patient c, with UID=p to the data structure. (b) FindDiff(p) - Find the difference between the number of Female patients and the number of Male patients only among all the patient records.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Searching",
      "subtopic": "Data Structure Design",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Given the sequence 'STONE' and 'LONGEST', can dynamic programming be used to solve the problem of determining the longest common subsequence (LCS)? Justify your answer with a clear explanation of how dynamic programming can be applied to this problem. Determine the LCS for the given sequences. Sequence 1: STONE and Sequence 2: LONGEST.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Dynamic Programming",
      "subtopic": "Dynamic Programming",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Given the equation F(n) = n + 100n - 2, find the values for cj, c2, and no for which F(n) = 6(g(n)). Provide a detailed step-by-step solution.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Trees",
      "subtopic": "Tree Algebra",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are given a binary search tree with pre-order traversal: 100, 20, 10, 30, 200, 150, 300. Consider the BST to be a complete tree. Your task is to convert the given binary search tree into a max heap by considering the in-order traversal of BST. Provide a function to implement the `convert_BST_MaxHeap` to accomplish this.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Trees",
      "subtopic": "Trees",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Given a sequence of numbers, create an AVL tree where the maximum element is always at the root. After constructing the AVL tree, identify the number of rotations required to maintain the AVL balance property. B. With respect to AVL trees, explain how the balancing factor is calculated and why maintaining a balance factor is crucial for efficient tree operations. C. Describe a scenario where implementing a Binary Search Tree (BST) would be more appropriate than an AVL tree for a given task, justifying your choice with a detailed explanation of the benefits and drawbacks of each tree type.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Trees",
      "subtopic": "Tree Balancing",
      "time": 13,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are tasked with implementing a function to find the k-th Fibonacci number. The Fibonacci sequence is defined as follows: F(0) = 0, F(1) = 1, and F(n) = F(n-1) + F(n-2) for n ≥ 2. You need to efficiently calculate the k-th Fibonacci number using dynamic programming. Your function should take n as input (where n is a positive integer) and return the k-th Fibonacci number. Please show your code and explain the steps of your approach.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Mathematics",
      "subtopic": "Dynamic Programming",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A hospital is planning to implement a new patient triage system. They have a large influx of patients arriving at the emergency room each day. The current triage process is inefficient, causing delays in treatment and potentially impacting patient outcomes. The new system must prioritize patients based on severity, ensuring the most critical cases receive immediate attention. Specifically, the system needs to assign patients to three tiers: Critical, Urgent, and Low Risk. Suggest three specific triage criteria that will be used to determine a patient's tier, justifying each criterion in terms of how it relates to real-world patient needs and potential challenges. Analyze the time complexity of the proposed triage algorithm. Derive the mathematical expression representing the algorithm's execution time with a maximum of 100 patients. Design an algorithm to automatically generate a report summarizing the top 5 patients in the triage system, including their priority level (Critical, Urgent, Low Risk), severity score, and reason for their placement. Explain your approach and analyze its efficiency considering potential edge cases (e.g., multiple patients with the same severity). Critically evaluate the use of rule-based triage in this system. Discuss advantages (e.g., ease of implementation) and limitations (e.g., difficulty in adapting to novel situations) regarding this approach, and suggest improvements for enhancing the system's adaptability.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Algorithms",
      "subtopic": "Algorithms For Triage",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A hospital is implementing a new patient triage system. Patients arrive with varying levels of symptoms. The system must prioritize patients based on a combination of symptoms and medical history. The system has two stages: a preliminary assessment and a detailed evaluation. (a) Outline three distinct assessment criteria that should be incorporated into the preliminary assessment stage of the triage system. Provide a justification for each criterion, explaining why it is essential for effective prioritization. (b) Describe how the detailed evaluation stage, incorporating the assessment criteria you outlined in (a), would differ from the preliminary assessment stage in terms of required data and the type of information extracted. (c) Imagine a scenario where a patient presents with a combination of mild respiratory symptoms and a history of asthma. Design an algorithm to prioritize this patient’s evaluation, explaining the steps and the reasoning behind selecting the order of priority, considering the assessment criteria outlined in (a). Specifically, identify the key information you would need from the patient to effectively triage the patient’s needs.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Algorithms",
      "subtopic": "Assessment Criteria & Prioritization",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Here’s the question text:  Consider a scenario where a child with a parcel is presented with a task requiring the performance of an act by other children. This process continues until only one child remains. The last remaining child is declared the winner. What data structure would be most efficient to implement this scenario, considering the fixed time slot when music stops, allowing for exchange of the parcel? Justify your choice, explaining how it addresses the core requirements of the problem.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Linked Lists",
      "subtopic": "General",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a binary tree where each node has a 'data' value. You are tasked with creating a function that traverses the tree and collects all leaf nodes. Specifically, the function should return a list containing all leaf nodes from the tree. The tree is represented as a nested structure: `struct node { int data; node child, next; bool leaf; };` Implement this function to traverse the tree and return a list. The root node is `NULL`. Assume the tree is structured such that the root is always `NULL`. Illustrate the function’s behavior with a sample tree containing the nodes `1`, `2`, `3`, `4`, `5`, `6`, `7`, and `8`. Your response should be clearly commented, detailing the logic behind each step.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Trees",
      "subtopic": "Trees: Traversal",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "In a binary tree, the root pointer maintains the start pointer of the linked list formed with leaf elements. This start pointer is crucial for efficiently accessing all the leaf nodes. Specifically, the function should return the created start pointer. Furthermore, use this start pointer to print all the leaves in the binary tree. Consider a binary tree with five nodes: Root, Left Child, Right Child, Left Child of Right Child, and Right Child of Right Child. Provide a function that takes the tree as input and returns the start pointer of the linked list of leaf nodes. After the function, print all the leaves of this tree, showing their node values. Mark: 2 marks",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Trees",
      "subtopic": "Trees And Linked Lists",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a hash table with size s=11 and a hash function with H(x) = x11. The keys are 11, 12, 19, 20, 52, 44, 56, 37, 60 are inserted in order. I. [1 mark] Perform the insertion in the hash table with H,(x)= x11 and H2(x)= 7-(x7) Il. [1 mark] Suppose if separate chaining is used then what will the cost of unsuccessful search. Il. [1 mark] In H(x) = x s, certain values of s are avoided, why Can you give any example of any such value Consider x is in decimal system and s is size of the hash table.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Hash Tables",
      "subtopic": "Hash Functions",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Consider a scenario where you need to efficiently manage a collection of distinct, randomly generated numbers. Each number will have a unique identifier. You need to implement a system that allows you to find all pairs of numbers within the collection that sum to a given target value. Describe a solution using a hash table to achieve this efficiently, considering the limitations of your approach (no other data structure available). Justify why a hash table is a suitable choice in this scenario, explaining how it avoids potential issues like hash collisions. Provide a pseudocode outline of the implementation.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Searching",
      "subtopic": "Hash Table Optimization",
      "time": 7,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Why do we use Big-O notation to compare algorithms Solve the following using asymptotic notation. F(n) = 10n* + 4n + 2 Find the value of c and no for which F(n) = O(g(n) ). 2. F(n) = 10n + 4n + 2, find whether n is upper bound for this function or not Which upper bound will you pick Explain with the help of a graph. Q2: Write a recursive function to perform binary search. Write a recurrence equation for this function and determine the time complexity using a recurrence relation. Show the calculations at every step using",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Searching",
      "subtopic": "Searching",
      "time": 8,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A large e-commerce website is experiencing slow response times during peak shopping hours. Analyze the potential causes of this performance bottleneck using asymptotic analysis. Specifically, consider the impact of different data structures and algorithms on query processing time. (a) Briefly describe how asymptotic analysis can be used to estimate the performance of different algorithms under varying load conditions. (b) Select two different linear data structures (e.g., arrays, linked lists) and two different non-linear data structures (e.g., trees, graphs) and compare their performance in terms of time and space complexity for a specific operation (e.g., searching for a specific item, sorting a list of items). Justify your selection of these data structures based on their characteristics. (c) Outline a greedy algorithm designed to efficiently retrieve a specific item from a large dataset. Explain how the greedy approach will likely perform compared to a more optimized algorithm that might involve backtracking or dynamic programming. Consider the trade-offs involved in choosing a greedy approach.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine a small town with 18 villages, and each village is connected to every other village via a road network represented by an adjacency matrix. The FCC has determined that radio stations should be placed in each village to prevent interference. The adjacency matrix shows that there are 18 villages, and each village is connected to 7 other villages. The FCC wants to assign frequency channels to each station to minimize the number of interfering frequencies. How many different frequency channels are required to ensure complete interference avoidance, considering the constraints of the adjacency matrix and the FCC’s objective? Answer: 1. (a) Solution: The FCC can use a Minimum Spanning Tree (MST) algorithm to find the minimum number of distinct frequency channels required. The MST will connect all villages, representing the complete network. The total number of edges in the MST will equal the number of pairs of villages (that are connected through the radio stations). The number of unique frequency channels is then the number of edges in the MST. 2. (b) Justification: While a simple MST is the most direct approach, an MST might not be optimal due to the potential for redundant connections. A more sophisticated algorithm could consider the connectivity within each village, and try to reduce the total number of distinct channels by minimizing the overlap between the connectivity of adjacent villages. 3. (c) Implementation: The MST algorithm (e.g., Kruskal's algorithm or Prim's algorithm) would be employed to find the minimum spanning tree. The number of edges in the MST represents the number of distinct frequencies required. The FCC would then need to consider the spectral characteristics of the frequencies to ensure that the chosen frequencies do not overlap significantly. The total number of frequencies is the number of edges in the MST. Mark Allocation:  1 Mark: Correctly identifies the MST and its connection to the number of frequency channels.  1 Mark: Provides justification for the use of the MST algorithm, demonstrating understanding of the connected components concept. * 0 Marks: Provides irrelevant or incorrect information or lacks justification.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Mathematics",
      "subtopic": "General",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The problem presented involves designing an algorithm to efficiently find the shortest path between two cities on a map, considering a river running through the middle. You are tasked with implementing a greedy algorithm to solve this problem. Explain, in detail, how the greedy approach would work, and provide a concise justification of why it is suitable for this specific scenario. Specifically, describe how the algorithm will prioritize selecting cities along the river's path, and what potential challenges might arise during this selection process. Consider the impact of the river’s position – how does this affect the optimal path selection? What time complexity can you estimate for this algorithm, assuming a relatively small number of cities involved?",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 7,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The provided data represents a network of cities connected by flyovers. A simple approach involves connecting each city on one side of the river to the city on the other side. However, the condition “connecting city to city 3 is not allowed” severely restricts this initial connection pattern. a) Briefly outline three different strategies for maximizing the number of pairs of cities connected, given this constraint, and explain how each strategy addresses the restriction. b) Considering the constraints, which of the proposed strategies would you recommend for achieving the highest possible number of connections while strictly adhering to the ‘no intersecting flyovers’ rule? Justify your recommendation with a clear explanation of why it’s the most viable option. c) Describe the time and space complexity of a possible implementation for the most optimal strategy, acknowledging the constraints and excluding any optimizations that could be easily achieved without properly considering the limitations imposed by the restriction.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Algorithms",
      "subtopic": "Algorithms And Constraints",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Can dynamic programming approach be used to solve the problem of determining the longest common subsequence (LCS) (Y/N)? Give a suitable justification to Support your answer. Determine the longest common subsequence (LCS) for the given Sequences. Sequence 1: STONE and Sequence 2: LONGEST [6 Marks] 1/2",
      "marks": 2,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Dynamic Programming",
      "subtopic": "Dynamic Programming",
      "time": 10,
      "source_file": "Generated_Questions"
    },
    {
      "question": "You are tasked with creating a system to efficiently track the number of students in a class. Each student has a unique ID. The system needs to maintain a count of all students present, allowing for efficient updates and queries. Describe a greedy algorithm approach to implement this, explaining its time and space complexity.",
      "marks": 2,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Trees",
      "subtopic": "Greedy Algorithms",
      "time": 12,
      "source_file": "Generated_Questions"
    },
    {
      "question": "Imagine you are tasked with designing a system to efficiently store and retrieve a large collection of customer data (name, address, purchase history, etc.). Which data structure would you most likely choose and why? Briefly describe the advantages and potential drawbacks of your chosen structure in relation to this scenario.",
      "marks": 2,
      "difficulty": "easy",
      "cognitive_level": "understanding",
      "topic": "Complexity Analysis",
      "subtopic": "Data Storage & Retrieval",
      "time": 11,
      "source_file": "Generated_Questions"
    },
    {
      "question": "A local bakery is experimenting with creating vegan pastries. They’ve identified that using almond milk for their buttercream frosting will reduce the amount of dairy used in their products. They want to determine how much reduction in dairy will occur when substituting almond milk for regular milk. What is the approximate percentage reduction in dairy content expected when substituting almond milk for regular milk in the buttercream frosting recipe? Justify your answer with a calculation and explanation.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Algorithms",
      "subtopic": "Buttercream Frosting Reduction",
      "time": 8,
      "source_file": "Generated_Questions"
    },
    {
      "question": "You are tasked with optimizing the placement of several key resources in a large office building to minimize the total distance traveled by employees accessing different departments. The building has a network of hallways and elevators. You have the following graph: ``` A B C D E / \\ / \\ / \\ / \\ / \\ 1 2 3 4 5 / \\ / \\ / \\ / \\ 6 7 8 9 10 11 / \\ / \\ / \\ / \\ / \\ / \\ \\ \\ \\ \\ 12 13 14 15 16 17 \\ \\ \\ \\ \\ 28 29 30 31 32 ``` What is the shortest path distance between every pair of vertices using the following graph? Explain your reasoning, considering factors like potential path length and node connectivity. Provide a program to print all combinations of numbers from 1 to m having sum s. Include your chosen programming language and the steps involved in the calculation. Assume the sum 's' is a given integer. Analyze the time/space complexity of the Rabin-Karp algorithm when searching for a pattern P=26 in the text T=3141592653589793 with q=11 and base value of 10. Derive the mathematical expression for the complexity. Design an algorithm/system for finding the smallest integer k such that a set of numbers chosen from the range [1, n] contains exactly k elements that are divisible by a given divisor d. Explain your approach and analyze its efficiency. Critically evaluate the use of a hash table for implementing a lookup table of sorted data in a program. Discuss the advantages and limitations of this approach, and suggest potential improvements.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Graphs",
      "subtopic": "Graphs",
      "time": 12,
      "source_file": "Generated_Questions"
    },
    {
      "question": "A dermatologist wants to represent a list of his patients record by their (UID). ror each patient, he would like to mork whether patient is a Male or Female. Suggest a data structure that supports the following operations in O(N) time in the worst case, Where N is the number of patients (Male and Female) in the data structure when following operations are executed. A. Insert(p,c) – Insert a new patient c, with UID=p to the data structure. B. FindDiff(p) – Find the difference between the number of Female patients and the number of Male patients only among all the patients. Provide a detailed explanation for your suggested data structure, justifying why it achieves O(N) time complexity in the worst case, considering the operations described.",
      "marks": 2,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Searching",
      "subtopic": "Data Structure Design",
      "time": 10,
      "source_file": "Generated_Questions"
    }
  ],
  "3_mark": [
    {
      "question": "A hash table with direct chaining collision resolution is designed for optimal performance. Describe the suggested data structure for a hash table utilizing direct chaining, detailing its key characteristics and why it’s chosen for efficient collision handling. Provide a brief explanation of the collision resolution strategy employed.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Computer Networks",
      "subtopic": "Hash Table Collision Handling",
      "time": 18,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Describe the primary purpose of using memory allocation schemes in programming, and explain how different schemes (e.g., static vs. dynamic) affect the efficiency of data structures. Provide a specific example of how you might choose one scheme over another in a given scenario.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Searching",
      "subtopic": "Memory Management",
      "time": 12,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Describe a scenario where a hash table with direct chaining collision resolution would be most suitable, and explain why this approach offers a significant advantage over alternative techniques in that context. (2 marks)",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Computer Networks",
      "subtopic": "Hash Table Collision",
      "time": 12,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Analyze the time/space complexity of a Balanced Binary Search Tree (BST) and derive the mathematical expression for its worst-case performance. Justify which is better for searching and insertion operations.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "evaluating",
      "topic": "Searching",
      "subtopic": "Time/Space Complexity Analysis",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "In the context of a hierarchical data structure, describe how the '11S' depicted in Figure 1 represents the relationships between nodes. Specifically, what does the parent-child relationship imply, and how does it impact the traversal order of nodes within the tree? Provide a concise example illustrating this relationship.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "understanding",
      "topic": "Computer Networks",
      "subtopic": "Parent-Child Relationship",
      "time": 6,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are tasked with implementing a system to track inventory levels for multiple stores. Each store has a list of products, and each product has a quantity. You need to efficiently identify products that are potentially out of stock based on the presence of several products in a list. Specifically, you are dealing with a scenario where two stores, Store A and Store B, share a common product 'Widget'. Store A has 10 widgets, and Store B has 5 widgets. You want to determine if Store A has any widgets that are not present in Store B's product list. Describe how you would implement this using a hash table to store the products of Store A and Store B, and explain the time complexity of your solution. Provide a simple example illustrating the core logic of identifying out-of-stock products.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "applying",
      "topic": "Trees",
      "subtopic": "Hash Tables",
      "time": 8,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Given an unsorted array of N elements, where each element is unique except for one element (E) that appears at least twice, devise an efficient algorithm to find the intersecting node structure (i.e., the node that appears more than once) in data structures. Describe the algorithm's time and space complexity, and provide a basic implementation in pseudocode.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Sorting",
      "subtopic": "Efficient Node Structure",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Analyze the relationship between a node’s parentage and its direct and indirect descendants. Specifically, identify the parent-child relationships for node 9, node 2, and node 5, and then explain how the parent-child structure determines the number of direct and indirect descendants of node 9. Provide a detailed example illustrating the process, including the number of direct and indirect descendants you identify.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Algorithms",
      "subtopic": "Parent-Child Relationships",
      "time": 11,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are developing a system to manage library inventory. A library has a list of books, each with a title, author, and ISBN. You need to implement a function to efficiently find all books by a specific author. The list of books is initially empty. The function should use a hash map to store the book titles and authors. Describe how you would structure the hash map and explain the time complexity of your approach. Consider how you might handle the case where the author is not found in the list. Provide a simple C++ code snippet illustrating the core logic of the function.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Trees",
      "subtopic": "Hash Tables",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The node X in the 2DA Q4 array is 9. Propose an efficient algorithm using suitable data structure to find out the node X for the given 2DA Q4(CO2, (Evaluate), ARR contains the following elements in the Show all the intermediate steps to sort the array ARR in ascending order using Radix ss Q5(CO2, (Evaluate), 3 marks. Propose an iterative algorithm for the binary search search an element in any given sorted array",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Searching",
      "subtopic": "Searching",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Given the scenario of analyzing a list of numbers representing carbon dioxide emissions (ARR) and identifying the node with the highest emission value (X), devise an iterative algorithm to efficiently locate this node. Justify your choice of data structure and explain the steps involved in the algorithm, detailing how the algorithm achieves its goal of finding the node with the highest emission value in O(log N) time.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Searching",
      "subtopic": "Iterative Algorithm",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A small, autonomous delivery robot is tasked with delivering packages to various locations within a city. The robot has a limited battery life and must navigate a complex network of streets, avoiding obstacles and prioritizing delivery locations based on a combination of distance and urgency. Given the robot's operational constraints, how would you optimize its route to minimize delivery time while ensuring a high probability of successful completion of all deliveries? Justify your answer with a detailed route planning strategy, outlining key steps and considerations.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Algorithms",
      "subtopic": "Route Optimization",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The code provided calculates the sum of integers from 1 to `n` using the `helper` function. The `helper` function `return (i4j+)2;` simplifies the calculation. Analyze the time complexity of the `helper` function in terms of the input `n`. Provide a mathematical expression representing the time complexity in terms of `n`.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Analyze the given infix expression `2(8-3)+447(9-(2+3))` and determine the resulting postfix expression, demonstrating each step of the evaluation using the stack method. Explain the role of each operation in the stack.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Stacks",
      "subtopic": "Stacks",
      "time": 12,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Here’s the question text:  Checker can be designed using both stack and queue, explain how these two approaches differ with respect to their data access mechanisms and processing steps. Further analyze which approach is more efficient in terms of time, space and ease of implementation, and justify your answer with an example. [COS (Analyzing), 4 marks]",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Stacks",
      "subtopic": "Data Access Mechanisms",
      "time": 12,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The code provided calculates the sum of integers from 1 to `n` using the `helper` function. The `helper` function `return (i4j+)2;` simplifies the calculation. Analyze the time complexity of the `helper` function in terms of the input `n`. Provide a mathematical expression representing the time complexity in terms of `n`.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Analyze the given infix expression `2(8-3)+447(9-(2+3))` and determine the resulting postfix expression, demonstrating each step of the evaluation using the stack method. Explain the role of each operation in the stack.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Stacks",
      "subtopic": "Stacks",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Here’s the question text:  Checker can be designed using both stack and queue, explain how these two approaches differ with respect to their data access mechanisms and processing steps. Further analyze which approach is more efficient in terms of time, space and ease of implementation, and justify your answer with an example. [COS (Analyzing), 4 marks]",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Stacks",
      "subtopic": "Data Access Mechanisms",
      "time": 12,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are designing a data structure to efficiently retrieve the middle element of a singly linked list. The linked list has a head node and a size (number of nodes). The function should return the value of the middle element. (a) Describe the time complexity of the given function. Provide justification for your answer, considering the worst-case scenario. (b) Illustrate, in pseudocode, how you would implement this function to find the middle element of the linked list, using an iterative approach. Assume the linked list has at least two nodes. (c) Explain, in a brief paragraph, how you would determine the middle element in the case where the linked list has an even number of nodes? Discuss the potential impact of this scenario on the function’s complexity.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Linked Lists",
      "subtopic": "Time Complexity Analysis",
      "time": 12,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are working with a singly linked list where each node contains a value and a pointer to the next node. The list has 4 nodes. The second middle node in the list is the exact center for odd-sized lists. Your task is to implement a function that efficiently finds and returns the value of the middle element of the linked list. Given the head of the list (which is the first node), return the value of the middle element. Assume the list is not empty. (a) Suggest a solution using a linear scan to find the middle element. Justify your solution with a discussion of its time and space complexity. (b) Implement the provided solution using a simple loop to iterate through the linked list and find the middle element. Describe the code's logic. (c) Assuming the list contains 4 nodes and the middle element is the value of the node at index 2 (remembering that the middle node is located in the second position), explain how the provided code would correctly identify the value of the middle element. Provide a complete and functional code example demonstrating the implementation.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Linked Lists",
      "subtopic": "Linked List Implementation",
      "time": 12,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Analyze the relationship between the Fibonacci sequence and the Golden Ratio. Provide three examples where the Golden Ratio emerges as a key characteristic, justifying your choices based on their numerical values or visual representation.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Algorithms",
      "subtopic": "Fibonacci And Golden Ratio",
      "time": 11,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Describe an efficient searching strategy to determine if a key exists in a 2D sorted matrix, outlining a sequence of comparisons. Explain why this strategy is effective for this specific scenario.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Mathematics",
      "subtopic": "Efficient Searching",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Given a 2D sorted matrix containing values from 1 to 30, determine whether the key '22' exists within the matrix. Describe a sequence of comparisons required to achieve this, including the logic behind each step.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Mathematics",
      "subtopic": "Binary Search And Matrix",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are tasked with optimizing the search for the key '22' within a 2-D sorted matrix. The matrix contains 3, 241 = 3 marks. Describe a time-efficient searching strategy to determine if '22' exists in the matrix, providing a sequence of comparisons demonstrating how the algorithm will function. Specifically, outline the steps involved in the search and justify the choice of this strategy in terms of its efficiency, considering the sorted nature of the matrix. Assume the matrix is represented using a standard 2D array.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Mathematics",
      "subtopic": "Searching Algorithms",
      "time": 13,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you are tasked with optimizing the deployment of software updates across a large network of servers. You have a set of strings X and Y, representing the names of different software versions. A randomly selected string from X is chosen as the pivot. The goal is to minimize the number of failed deployments caused by incompatible software versions. (a) Describe the algorithm you would use to determine the optimal pivot and explain why this approach is beneficial in this context. (2 marks) (b) Provide a concise, step-by-step implementation of the chosen algorithm in pseudocode. (1 mark) (c) Analyze the time complexity of the proposed algorithm. Derive the mathematical expression for the complexity. (1 mark) Explain the trade-offs between different pivot selection strategies, considering factors like the probability of a failed deployment and the potential for increased operational complexity. How might you adapt your approach based on the expected distribution of string X? (2 marks)",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Sorting",
      "subtopic": "Optimization & Deployment",
      "time": 13,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Analyze the impact of using different font sizes on readability for a large-scale document, focusing on how changes in font size affect the visual flow of text and the overall comprehension of the document. Provide three specific examples of document types and their optimal font size ranges, justifying your choices based on principles of visual hierarchy and cognitive load.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Algorithms",
      "subtopic": "Readability And Flow",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The provided data set consists of 25 distinct elements, each representing a number from 23 to 97. The data is sorted in ascending order. Describe the steps involved in maintaining the AVL tree structure, highlighting the key operations required to ensure its balanced state. Specifically, explain how the `balance()` and `rotateLeft()` operations contribute to maintaining this balance, and what is the expected time complexity for each operation when performing insertions and deletions at the root of the tree?",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Sorting",
      "subtopic": "Avl Tree Operations",
      "time": 13,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A large research lab is developing a new method for analyzing gene expression data. They have collected a dataset containing thousands of samples with varying levels of gene expression. The data is presented as a matrix where each row represents a sample and each column represents a gene. The goal is to identify genes that show significant changes in expression correlated with a specific environmental factor (e.g., temperature). The lab has identified three possible methods: Method A – a simple filtering approach, Method B – a clustering algorithm, and Method C – a more complex statistical model. Method A involves simply selecting genes with the highest variance in expression, while Method B groups similar genes together based on expression values. Method C utilizes a random forest model to predict gene expression changes based on the data. The lab believes Method C offers the most robust analysis, but needs to determine its computational cost. How would you recommend the lab prioritize testing Method C? Justify your recommendation based on the characteristics of the dataset and the potential goals of the analysis.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Algorithms",
      "subtopic": "Statistical Modeling",
      "time": 13,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A binary search tree is constructed to store student records (name, ID, grade). The tree should maintain sorted order by student ID. Describe the process of performing a binary search within the tree, specifically outlining the steps required to locate a student with ID 100. Explain the time complexity of the binary search operation.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Trees",
      "subtopic": "Binary Search Tree",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are tasked with implementing an AVL tree data structure to store a collection of musical notes (e.g., C, D, E, etc.). The AVL tree is designed to efficiently support the retrieval and insertion of musical notes. Specifically, the tree must maintain a balanced structure, ensuring logarithmic time complexity for operations like insertion, deletion, and search. Describe the steps involved in maintaining the AVL tree after a 5-note removal operation, including the necessary rotations and balancing operations. Illustrate this process with a diagram representing the resulting tree structure and a rotation that addresses the imbalance, focusing on the core logic of the AVL tree's balancing algorithm. Explain how the balance factor is calculated and how this affects subsequent rotations.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Trees",
      "subtopic": "Trees Balancing",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The provided text details the process of identifying all possible pre-fixes of digits within a given string. Consider the input string \"122\". Outline the steps involved in extracting and presenting all possible pre-fixes, justifying your approach with clear explanations. Specifically, discuss how you would iterate through the string and identify potential pre-fixes of each digit, and then format the output in a manner suitable for presenting to a user. Assume the user needs to quickly assess the potential usefulness of each identified pre-fix.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Searching",
      "subtopic": "Prefix Identification",
      "time": 13,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The provided text describes a binomial heap implementation for merging sorted arrays. Explain, step-by-step, how a binomial heap would be constructed and used to merge two sorted arrays, highlighting the key operations involved. Specifically, detail the insertion and deletion operations performed within the binomial heap.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Sorting",
      "subtopic": "Binomial Heap Implementation",
      "time": 14,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A large agricultural research facility is experimenting with using drones to monitor crop health. They’ve collected data showing that drone imagery reveals a significant correlation between the density of specific leaf types and yield. The facility wants to optimize drone flight paths to maximize crop yield. What is the most efficient way to determine which leaf types are most impactful for yield, considering the data and the constraints of the drone’s flight time and battery life? Suggest a strategy incorporating data analysis and optimization, justifying your chosen approach and its potential efficiency gains.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Algorithms",
      "subtopic": "Optimization & Data Analysis",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A large e-commerce company is launching a new personalized product recommendation engine. They want to suggest products to users based on their past purchases, browsing history, and items they’ve added to their wishlist. The system currently uses a simple rule-based approach, recommending items similar to those the user has purchased recently. However, the initial tests show that this approach is not very effective in increasing user engagement and sales. Analyze the potential benefits and drawbacks of implementing a more sophisticated recommendation engine (e.g., incorporating collaborative filtering, content-based filtering, or a hybrid approach) compared to the current rule-based system. Justify which approach, if implemented, would be more beneficial for the e-commerce company, considering factors such as user experience and conversion rates. ---",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Algorithms",
      "subtopic": "Algorithms",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A dermatologist wants to represent a list of his patients record by their (UID). ror each patient, he would like to mork whether patient is a Male or Female. Suggest a data structure that supports the following operations in O(N) time in the worst case, Where N is the number of patients (Male and Female) in the data structure when following operations are executed. Describe a data structure that efficiently supports the following operations: 1. Insert(p, c) - Insert a new patient c, with UID=p to the data structure. 2. FindDiff(p) - Find the difference between the number of Female patients and the number of Male patients only among all the patients recorded. Justify your chosen data structure and explain why it achieves O(N) time complexity in the worst case for each operation. Specifically, consider the operations involved and their potential performance implications.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Searching",
      "subtopic": "Data Structure Optimization",
      "time": 13,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A small business is considering implementing a new customer relationship management (CRM) system to improve sales and customer service. The current system is outdated and lacks sufficient segmentation. The business wants to increase customer retention by 15% within the next year. Suggest three specific CRM features that would help achieve this goal, justifying each feature's potential impact on customer retention and detailing how it would be implemented within the existing business framework. Analyze the time complexity of the sorting algorithm used to determine the top 10 products based on purchase frequency, considering both the number of products and the number of purchases. Derive the mathematical expression representing the time complexity. Design an algorithm to efficiently identify and segment customers based on their spending habits and purchase history. Explain your approach and analyze its efficiency, considering factors like scalability and error handling. Critically evaluate the use of social media marketing as a primary customer retention strategy. Discuss the potential benefits (e.g., increased brand loyalty) and drawbacks (e.g., negative publicity, difficulty in measuring ROI) of this approach. Suggest three specific modifications to enhance the effectiveness of social media marketing for customer retention. Given a dataset of customer service interactions, including timestamps, agent notes, and customer issue details, design an algorithm to automatically categorize incoming support tickets based on issue type and urgency. Explain your approach and analyze its efficiency, taking into account the potential for false positives and false negatives.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Algorithms",
      "subtopic": "Algorithms",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you are tasked with designing a system to manage a library's inventory. The library has a collection of 100 books, with each book having a unique ISBN. The system needs to efficiently track the number of copies of each book available, allowing librarians to quickly check book availability. Describe, in detail, the data structures you would recommend to implement this system, explaining why you chose those structures and considering their efficiency. Specifically, outline the choice of data structure for each stage of the inventory process (e.g., adding a new book, checking availability, updating book details). Briefly explain how the chosen structure will minimize the time taken for these operations.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 14,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Given a binary search tree with a root node containing the value 50, describe how you would use the in-order traversal to determine the number of nodes in the tree. Justify your approach with a time complexity analysis.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Trees",
      "subtopic": "Tree Traversal",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are tasked with implementing a data structure that maintains a sorted list of numbers. The data structure should include both a Binary Search Tree (BST) and an AVL tree. The algorithm should efficiently find the minimum element in the list, and when the minimum element is found, delete it from the list. Assume the input list is initially empty. Describe the steps involved in constructing the AVL tree from the sorted input list, including the rotation operations needed to maintain its balance. Then, demonstrate how to find the minimum element in the constructed AVL tree and delete it. Illustrate the deletion process with a simple example. Assume the input list is `[5, 2, 8, 1, 9, 4]`.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Trees",
      "subtopic": "Tree Structure And Operations",
      "time": 12,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Analyze the efficiency of the provided interpolation search algorithm. Provide a time complexity analysis considering the number of comparisons required.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Searching",
      "subtopic": "Interpolation Search",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A hospital is implementing a new patient intake process to improve efficiency. Currently, patients are manually entered into the system via paper forms. The new system utilizes an OCR (Optical Character Recognition) software to automatically extract patient information. The system currently has a processing time of 30 minutes per patient. The hospital needs to determine if automating the patient intake process will actually improve efficiency. Suggest a strategy incorporating OCR and justify the expected improvement in time efficiency. Compare and contrast the strengths and weaknesses of using a rule-based system versus a machine learning-based system for analyzing customer reviews. Justify which approach would be more suitable for analyzing product reviews related to a new smartphone. Design an algorithm to find the shortest path between two points in a graph represented by a network of roads. Explain your approach, including the steps involved, and derive the mathematical expression for calculating the total distance traveled. Critically evaluate the effectiveness of using a hierarchical clustering algorithm for segmenting customer demographics based on purchasing behavior. Discuss potential challenges and limitations in applying this method, and suggest improvements. Given a dataset of sales transactions with columns: `TransactionID`, `ProductID`, `Date`, `Quantity`, `Price`, and `CustomerSegment`, implement a simple system to calculate the total revenue generated by each customer segment. Trace through the execution and provide an example of how the revenue calculation would differ for different customer segments.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Algorithms",
      "subtopic": "Algorithms For Analysis",
      "time": 18,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A hospital is implementing a new patient triage system. Currently, patients are assessed at the front desk, and a triage nurse manually assigns them to different categories based on severity. The new system aims to reduce the workload on the triage nurse and improve patient flow. Consider the scenario where a patient arrives with a suspected ankle injury. What are three potential triage categories the new system should automatically assign, and explain why each category is appropriate for this scenario, justifying your selection based on the provided information?",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Algorithms",
      "subtopic": "Triage Categorization",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The QuickSort algorithm is designed to partition an array into three sub-arrays: one containing elements smaller than the pivot, one containing elements equal to the pivot, and one containing elements greater than the pivot. Consider a sample array containing the following elements: {5, 9, 7, 6, 5, 8, 7, 8, 5, 8, 9, 6, 9, 7}. Outline the steps involved in the partitioning process (a) and briefly describe how the resulting sub-arrays would be constructed. Then, provide a concise comparison (b) of the partitioning results achieved with the different pivot values (7 and 8) and discuss the potential impact of the pivot selection on the overall performance of the QuickSort algorithm. Finally, discuss a potential optimization strategy (c) you could implement to improve the performance of the partitioning step in the case of a large array.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Sorting",
      "subtopic": "Sorting And Partitioning",
      "time": 13,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are developing a sorting algorithm for a large dataset of customer reviews. The dataset contains customer reviews with a range of text lengths. You are implementing a quick sort algorithm and want to determine its performance with different values of ‘k’ (the maximum element size in the dataset). Specifically, consider scenarios where the dataset consists of reviews with lengths ranging from 10 to 1000 characters. a) Briefly describe how quick sort works and outline the key steps involved in its implementation, considering the potential for performance degradation as 'k' increases. Provide a justification for why quick sort might be less efficient for very large datasets compared to more optimized sorting algorithms. b) Compare and contrast the time complexity of quick sort with the merge sort algorithm when dealing with datasets containing elements with significantly varying lengths. Justify your comparison, considering the memory footprint involved. c) Imagine a scenario where you have a dataset of 10000 reviews, and you decide to use quick sort with a ‘k’ value of 100. Describe, in detail, what happens to the execution time of the quick sort algorithm as 'k' increases to 1000. Include a graph or visual representation illustrating the potential performance differences. Assume the memory usage remains constant.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Sorting",
      "subtopic": "Sorting Performance Analysis",
      "time": 10,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you are implementing a function to partition an array of integers into groups based on their values, where each group contains at most three elements. You are given an array containing duplicate values within the range of 5 to 9. Write a function that partitions the array, placing each element into a group that contains no more than three elements. Specifically, the function should return the number of groups formed, where each group contains no more than three elements. Provide a clear, commented implementation of the function, explaining the logic behind the partitioning process. Consider edge cases involving empty arrays or arrays with fewer than three elements, ensuring the function handles these gracefully. Justify your approach with a brief analysis of its time and space complexity, considering the input array size.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Stacks",
      "subtopic": "Partitioning And Grouping",
      "time": 12,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Here's the question text: Question 1: Real-Time Data Synchronization Consider a scenario where you need to synchronize a stream of sensor readings across multiple devices in a field operation. Each device transmits data with a variable latency (measured in milliseconds). You have no access to any pre-existing data structures like arrays or linked lists to efficiently store or sort the readings. Describe a strategy for maintaining data consistency during this synchronization process. Justify your chosen approach, highlighting its key components and potential challenges. Question 2: Post-Order Traversal Perform the post-order traversal of the following tree: w HM M L GIG Q) ) Question 3: Algorithm Analysis Analyze the time and space complexity of a binary search algorithm implemented using an array. Derive the mathematical expression for the time complexity. Explain how the complexity changes as the input size increases.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Trees",
      "subtopic": "Strategy For Synchronization",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Given the array {10, 20, 30, 40, 50}, describe the time complexity of a simple sorting algorithm (e.g., bubble sort) and illustrate its implementation using back substitution method. Explain the steps involved, calculating the swaps at each iteration. Q2: [3 Marks] Consider two arrays A = {5, 4, 3, 2, 1} and B = {1, 2, 3, 4, 5}. Using bubble sort, arrange the arrays in ascending order. Write the number (i.e., count) of swaps required to sort the arrays using bubble sort. Q3: [3 Marks] Develop a program to create a doubly linked list that stores days of the month in sorted order. Define the data structure, explain the linking operation, and provide a simple function to insert a new day into the list. Q4: [5 Marks] Design an algorithm for efficiently extracting the smallest element from a sorted array of integers. Explain your algorithm including how you achieve the smallest element finding without using extra memory (e.g., in-place sort). Briefly discuss the time complexity and space complexity of the algorithm.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Linked Lists",
      "subtopic": "Algorithm Design",
      "time": 16,
      "source_file": "Initial_Questions"
    },
    {
      "question": "Imagine you are tasked with designing a system to efficiently manage a library's collection of books. The library has a collection of 100 books, and each book has a unique ISBN. You need to implement a system to quickly find books based on their ISBN. Consider the following: (a) Briefly outline three different approaches to efficiently search for a book by ISBN, detailing their time and space complexity. (b) Choose two of the listed approaches and, for each, implement a simplified version of the chosen approach using a pseudocode language. (c) Describe a scenario where you would choose to implement the Backtracking algorithm over the other two approaches, justifying your decision based on the nature of the data and the potential problem constraints. Provide a minimal example demonstrating the Backtracking algorithm in action.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Complexity Analysis",
      "subtopic": "Complexity Analysis",
      "time": 18,
      "source_file": "Initial_Questions"
    },
    {
      "question": "You are tasked with implementing a Depth-First Search (DFS) traversal algorithm for a stack data structure. The stack consists of elements that can be either positive or negative values. Describe how you would implement a non-recursive DFS version of DFS, utilizing Linked Lists for the stack. Provide a step-by-step explanation of how the linked list representation would handle the stack operations (push, pop, peek, and traversal). Then, illustrate how you would implement a simple AVL tree insertion and deletion operation using the linked list representation, incorporating the necessary balancing techniques to maintain the AVL tree’s properties. Finally, compare and contrast the two approaches – the non-recursive DFS and the AVL tree implementation – in terms of their efficiency and suitability for specific scenarios, justifying your choice.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Trees",
      "subtopic": "Tree Implementation",
      "time": 17,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A large e-commerce company is implementing a new inventory management system. They have a massive catalog of products with hundreds of thousands of SKUs (Stock Keeping Units). Currently, they rely on a manual process involving spreadsheets and manual data entry. The new system needs to accurately track inventory levels across all warehouses and distribution centers. How would you design an algorithm to efficiently determine the optimal number of warehouse locations to minimize operational costs while maintaining sufficient stock availability, considering the product’s demand and distribution characteristics? Justify your approach using specific metrics. Compare and contrast the efficiency of using a relational database versus a NoSQL database for storing product information and inventory data. Justify which approach is more suitable for this specific e-commerce scenario, considering factors like scalability and query complexity. Analyze the time/space complexity of the following sorting algorithm: Bubble Sort. Derive the mathematical expression for its time complexity. Design an algorithm for processing a stream of customer orders. Explain your approach, including data structures utilized, and analyze its efficiency in terms of both time and space complexity. Provide an example demonstrating the algorithm's execution with a small sample dataset. Critically evaluate the use of predictive analytics for customer churn prediction in the e-commerce industry. Discuss the potential advantages and limitations of relying solely on predictive models, and suggest improvements to enhance the accuracy and reliability of churn prediction.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Algorithms",
      "subtopic": "Algorithms For Inventory Management",
      "time": 15,
      "source_file": "Initial_Questions"
    },
    {
      "question": "The FCC has identified a network of 18 villages connected by roads. Each pair of villages has a distance of 5 miles. They are installing radio stations to prevent interference. The FCC wants to assign frequency channels to each station such that no two stations transmit simultaneously. What is the minimum number of different frequency channels required to ensure this interference prevention, and explain your reasoning? Provide a breakdown of how you would approach this problem using a specific algorithm or strategy.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Mathematics",
      "subtopic": "Frequency Allocation",
      "time": 16,
      "source_file": "Initial_Questions"
    },
    {
      "question": "A telecom company wants to distribute SIM cards to different cities of a state. Since the cities are connected directly/indirectly, for the SIM card distribution the company first decided to compute the minimum cost of travelling between all cities using a weighted graph G(V,E,w). Where V represents the city number, E represents the edges (connections) between different cities and w is the cost of travelling from one city to another. Determine the shortest path distance between every pair of vertices in the weighted graph G(V,E,w). Write the function to compute the final cost of each vertex pair. [7] Provide a function that implements Dijkstra’s algorithm to calculate the shortest path distances between all pairs of cities in the graph G(V, E, w), and return the final cost matrix. Justify your approach by highlighting the core steps and how they address the problem's requirements.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Graphs",
      "subtopic": "Graphs",
      "time": 14,
      "source_file": "Generated_Questions"
    },
    {
      "question": "A hospital is planning to implement a new patient triage system. The current triage process involves assigning patients to different lanes based on a combination of factors: age, symptoms, and urgency. The new system aims to reduce the time taken to triage patients and improve patient flow. Considering the scenario, what are three key challenges the hospital should anticipate when implementing this new triage system, and how might they be addressed? (a) Suggest three challenges and provide justification for each. (b) Implement a simplified version of the triage process using the suggested challenges and justification, demonstrating the expected output. (c) Critically evaluate the proposed triage system from a patient perspective, discussing both potential benefits and potential drawbacks, and suggest improvements. --- A. Age, symptoms, and urgency are factors, but patients with chronic conditions might require slightly longer assessment time. B. The system’s reliance on age could lead to inaccurate triage decisions for younger patients, potentially delaying critical care. C. The system could be prone to bias if the criteria used for age, symptoms, and urgency are not carefully calibrated, creating disparities in patient prioritization. --- A. 2 Marks – Justification & Implementation – The hospital needs to account for variations in patient health and potential for complications based on age and symptoms. Implement a tiered triage system where younger patients are assessed faster but receive slightly more intensive monitoring. A pilot program with diverse patient demographics should be conducted to identify potential biases. B. 3 Marks – Justification & Implementation – Create a simplified triage process with age, symptoms, and urgency as factors. The system should prioritize immediate life-threatening conditions (e.g., chest pain, difficulty breathing) and then assess more complex conditions. The system should output a triage lane (e.g., high priority, medium priority, low priority) for each patient. Demonstrate the output in a table with example patient profiles. C. 3 Marks – Critical Evaluation – The triage system risks prioritizing younger patients, potentially overlooking patients with chronic conditions requiring immediate attention. It could exacerbate existing inequities in healthcare access. Suggest improvements: Implement a more robust algorithm to account for patient history and underlying conditions alongside these factors. Introduce a human oversight layer to verify triage decisions and provide a second opinion for complex cases. Also, ensure patient data privacy and security are maintained throughout the process.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Algorithms",
      "subtopic": "Algorithms",
      "time": 16,
      "source_file": "Generated_Questions"
    },
    {
      "question": "The Rabin-Karp algorithm efficiently searches for pattern occurrences within a text. Let’s consider a text T = 3141592653589793 and a pattern P = 26. Calculate the number of spurious hits encountered by the Rabin-Karp algorithm when searching for P in T. Provide a detailed explanation of what a spurious hit is and how it affects the algorithm's performance. Specifically, state the number of hits and the number of false positives and false negatives in the scenario.",
      "marks": 3,
      "difficulty": "medium",
      "cognitive_level": "analyzing",
      "topic": "Graphs",
      "subtopic": "Hash Function Analysis",
      "time": 13,
      "source_file": "Generated_Questions"
    }
  ]
}